//
//  Graph.m
//  bjsubway
//
//  Created by apple on 14/12/10.
//  Copyright (c) 2014年 bangtech. All rights reserved.
//

#import "Graph.h"
#import "ViewController.h"
#import "queue.h"

@implementation Graph : NSObject 

- (instancetype) initWithGraphList:    (GraphList*) g{
    //GraphList g;
    //memset(&g,0,sizeof(GraphList));
    self = [self init];
    [self createGraph:g];
   _graph = [NSValue valueWithPointer:g];
 
    return self;
}
- (NSArray*) Nearby:(CGPoint) touchPoint{
    NSMutableArray* array = [NSMutableArray array];
    int fibNum[] = {5,10,15,20,25,30};
   
    for(int m = 0;m<sizeof(fibNum)/sizeof(int);m++)
    {
        int i;
        for(i = 0; i < [_numVertexes intValue]; i++)
        {
            if(ccpDistance(touchPoint,((GraphList*)[_graph pointerValue])->adjList[i].data.pos)<fibNum[m])
            {
                NearBy *near = malloc(sizeof(NearBy));
                memset(near,0,sizeof(NearBy));
                near->vexid = i;
                NSString* name = [self NameByIndex:i];
                memcpy(near->staname,[name UTF8String],[name lengthOfBytesUsingEncoding:NSUTF8StringEncoding]);
                near->pos =((GraphList*)[_graph pointerValue])->adjList[i].data.pos;
                [array addObject:[NSValue valueWithPointer:near]];
                NSLog(@" %d ",i);
            }
        }
        if([array count]>0)
            break;
    }
    
    return (NSArray*)array;
}
- (NSString*) NameByIndex:(int) index{
    NSArray* fragments = [_dataware[index] componentsSeparatedByString:@","];
    
    return fragments[1];
}
- (int) Locate:(CGPoint) touchPoint{
    int i;
    for(i = 0; i < MAXVEX; i++)
    {
        if(ccpDistance(touchPoint,((GraphList*)[_graph pointerValue])->adjList[i].data.pos)<2)
        {
            break;
        }
    }
    if(i >= MAXVEX)
    {
        fprintf(stderr,"there is no vertex.\n");
        return -1;
    }
    return i;
}

-(void) createGraph:(GraphList*)g{
    NSString* data[] = {
        @"0,苹果园, 128.500000,210.500000,2,1,2.5",
        @"1,古城,137.000000,218.500000,2,0,2.5,2,1.9",
        @"2,八角游乐园, 151.500000,218.500000,2,1,1.9,3,2.4",
        @"3,八宝山,164.500000,218.500000,2,2,2.4,4,0.9",
        @"4,玉泉路,175.500000,218.500000,2,3,0.9,5,1.7",
        @"5,五棵松,186.500000,218.000000,2,4,1.7,6,1.8",
        @"6,万寿路,199.000000,218.000000,2,5,1.8,7,1.2",
        @"7,公主坟,211.500000,218.500000,2,6,1.2,8,1.7,208,1.0,209,2.2",
        @"8,军事博物馆,226.000000,218.50000,2,7,1.7,9,2.2,166,1.4,167,2.6",
        @"9,木樨地,246.500000,218.000000,2,8,2.2,10,1.2",
        @"10,南礼士路,257.500000,218.50000,2,9,1.2,11,1.5",
        @"11,复兴门,269.000000,218.50000,2,10,1.5,12,1.6,47,1.2,49,1.8",
        @"12,西单,291.000000,218.500000,2,11,1.6,13,1.2,65,0.9,46,0.8",
        @"13,天安门西,307.500000,218.50000,2,12,1.2,14,0.8",
        @"14,天安门东,325.500000,218.50000,2,13,0.8,15,1.3",
        @"15,王府井,337.500000,218.50000,2,14,1.3,16,1.1",
        @"16,东单,348.000000,218.000000,2,15,1.1,17,1.3,43,0.8,88,1.0",
        @"17,建国门,366.500000,218.00000,2,16,1.3,18,1.3,41,1.8,42,1.0",
        @"18,永安里,380.500000,218.50000,2,17,1.3,19,0.8",
        @"19,国贸,394.500000,218.500000,2,18,0.8,20,1.3,192,0.9,193,1.7",
        @"20,大望路,412.000000,218.50000,2,19,1.3,21,1.6",
        @"21,四惠,430.500000,219.500000,2,20,1.6,22,1.7",
        @"22,四惠东,443.000000,218.50000,2,21,1.7,23,1.3",
        @"23,高碑店,453.000000,221.00000,2,22,1.3,24,1.9",
        @"24,传媒大学,464.000000,221.00000,2,23,1.9,25,1.8",
        @"25,双桥,476.500000,221.000000,2,24,1.8,26,1.9",
        @"26,管庄,488.500000,221.000000,2,25,1.9,27,1.7",
        @"27,八里桥,502.000000,221.00000,2,26,1.7,28,1.7",
        @"28,通州北苑,509.000000,224.00000,2,27,1.7,29,1.4",
        @"29,果园,514.000000,230.000000,2,28,1.4,30,0.9",
        @"30,九棵树,518.500000,234.00000,2,29,0.9,31,1.2",
        @"31,梨园,523.500000,239.500000,2,30,1.2,32,1.2",
        @"32,临河里,529.500000,245.00000,2,31,1.2,33,0.7",
        @"33,土桥,535.500000,251.000000,2,32,0.7",
        @"34,西直门,269.000000,180.500000,2,50,0.8,35,1.8,61,1.6,62,1.0,213,2.8",
        @"35,积水潭,287.500000,174.000000,2,34,1.8,36,1.7",
        @"36,鼓楼大街,317.500000,174.000000,2,35,1.7,37,1.2,150,2.3,151,1.1",
        @"37,安定门,331.500000,174.500000,2,36,1.2,38,1.1",
        @"38,雍和宫,347.500000,174.000000,2,37,1.1,39,2.6,91,1.0,92,1.4",
        @"39,东直门,367.000000,181.000000,2,38,2.6,40,0.8,221,1.7",
        @"40,东四十条,366.500000,192.500000,2,39,0.8,41,1.0",
        @"41,朝阳门,367.000000,203.500000,2,40,1.0,17,1.8,89,1.4,122,1.5",
        @"42,北京站,365.000000,231.000000,2,17,1.0,43,0.9",
        @"43,崇文门,348.000000,232.500000,2,42,0.9,44,1.9,87,0.8,16,0.8",
        @"44,前门,317.500000,232.500000,2,43,1.9,45,1.9",
        @"45,和平门,302.500000,232.500000,2,44,1.9,46,0.8",
        @"46,宣武门,291.000000,232.000000,2,45,0.8,47,0.9,12,0.8",
        @"47,长椿街,269.500000,230.000000,2,46,0.9,48,1.2",
        @"48,复兴门,268.500000,218.500000,2,47,1.2,49,1.8,10,1.5,12,1.6",
        @"49,阜成门,269.000000,207.000000,2,48,1.8,50,1.0",
        @"50,车公庄,269.000000,196.500000,2,49,1.0,34,0.8,119,0.9,63,1.4",
        @"51,安河桥北,185.0,111.5,2,52,1.9",
        @"52,北宫门,200.0,111.5,2,51,1.9,53,1.2",
        @"53,西苑,214.0,111.5,2,52,1.2,54,2.1",
        @"54,圆明园,225.5,120.5,2,53,2.1,55,1.6",
        @"55,北京大学东门,226.0,130.5,2,54,1.6,56,1.0",
        @"56,中关村,226.5,139.0,2,55,1.0,57,1.0",
        @"57,海淀黄庄,226.0,150.5,2,56,1.0,58,1.0,179,0.9,180,1.0",
        @"58,人民大学,226.0,162.5,2,57,1.0,59,1.0",
        @"59,魏公村,226.0,173.0,2,58,1.0,60,1.6",
        @"60,国家图书馆,226.5,181.0,2,59,1.6,61,1.7,118,1.1",
        @"61,动物园,248.5,181.5,2,60,1.7,34,1.6",
        @"62,新街口,285.0,181.0,2,34,1.0,63,1.1",
        @"63,平安里,291.0,197.0,2,62,1.1,64,1.0,50,1.4,120,1.2",
        @"64,西四,291.0,203.5,2,63,1.0,65,0.8",
        @"65,灵境胡同,291.0,210.0,2,64,0.8,46,0.9",
        @"66,菜市口,291.0,242.0,2,46,1.1,67,1.9,253,1.4,254,0.9",
        @"67,陶然亭,291.5,250.5,2,66,1.9,68,1.6",
        @"68,北京南站,291.5,257.5,2,67,1.6,69,1.7",
        @"69,马家堡,291.0,268.0,2,68,1.7,70,0.8",
        @"70,角门西,291.0,274.5,2,69,0.8,71,0.9,201,1.2,202,1.5",
        @"71,公益西桥,292.0,286.0,2,70,0.9,72,2.8",
        @"72,新宫,291.5,296.5,2,71,2.8,73,5.0",
        @"73,西红门,275.5,304.5,2,72,5.0,74,1.7",
        @"74,高米店北,276.0,311.0,2,73,1.7,75,1.1",
        @"75,高米店南,276.0,317.5,2,74,1.1,76,1.1",
        @"76,枣园,276.0,324.0,2,75,1.1,77,1.1",
        @"77,清源路,276.0,330.5,2,76,1.1,78,1.2",
        @"78,黄村西大街,275.0,336.5,2,77,1.2,79,1.0",
        @"79,黄村火车站,275.5,342.5,2,78,1.0,80,1.8",
        @"80,义和庄,275.0,349.5,2,79,1.8,81,2.9",
        @"81,生物医药基地,275.5,356.0,2,80,2.9,82,1.8",
        @"82,天宫院,275.5,362.5,2,81,1.8",
        @"83,宋家庄,348.0,275.5,2,84,1.7,103,2.9,198,1.6,199,1.2",
        @"84,刘家窑,348.0,267.5,2,85,0.8,83,1.7",
        @"85,蒲黄榆,348.0,257.5,2,86,1.8,84,0.8",
        @"86,天坛东门,347.5,251.5,2,87,1.2,85,1.8",
        @"87,磁器口,348.0,241.5,2,43,0.8,86,1.2,256,1.0,257,1.1",
        @"88,灯市口,347.5,211.0,2,89,0.7,16,1.0",
        @"89,东四,348.5,204.0,2,90,1.0,88,0.7,121,1.9,41,1.4",
        @"90,张自忠路,348.5,194.0,2,91,0.8,89,1.0",
        @"91,北新桥,347.5,185.5,2,38,1.0,90,0.8",
        @"92,和平里北街,347.5,168.0,2,93,1.0,38,1.4",
        @"93,和平西桥,348.5,161.0,2,94,0.9,92,1.0",
        @"94,惠新西街南口,348.5,150.0,2,95,1.2,93,0.9,185,0.9,186,1.7",
        @"95,惠新西街北口,347.5,143.5,2,96,1.7,94,1.2",
        @"96,大屯路东,347.5,133.5,2,97,2.9,95,1.7,239,0.9,240,1.1",
        @"97,北苑路北,347.5,122.5,2,98,1.3,96,2.9",
        @"98,立水桥南,348.0,113.5,2,99,1.3,97,1.3",
        @"99,立水桥,348.0,104.5,2,100,1.5,98,1.3,141,4.8,218,2.3",
        @"100,天通苑南,348.0,95.5,2,101,0.9,99,1.5",
        @"101,天通苑,348.0,84.5,2,102,0.9,100,0.9",
        @"102,天通苑北,348.0,75.0,2,101,0.9",
        @"103,肖村,347.0,286.0,2,104,1.3,83,2.9",
        @"104,小红门,352.5,291.5,2,105,2.4,103,1.3",
        @"105,旧宫,357.5,296.5,2,106,1.9,104,2.4",
        @"106,亦庄桥,362.5,301.0,2,107,0.9,105,1.9",
        @"107,亦庄文化园,367.0,305.5,2,108,1.5,106,0.9",
        @"108,万源街,371.5,310.0,2,109,1.2,107,1.5",
        @"109,荣京东街,377.5,316.0,2,110,1.3,108,1.2",
        @"110,荣昌东街,382.5,320.0,2,111,2.3,109,1.3",
        @"111,同济南路,389.5,322.0,2,112,2.2,110,2.3",
        @"112,经海路,401.0,322.0,2,113,2.0,111,2.2",
        @"113,次渠南,413.0,322.0,2,114,1.2,112,2.0",
        @"114,次渠,424.5,322.0,2,113,1.2",
        @"115,海淀五路居,186.5,197.0,2,116,1.4",
        @"116,慈寿寺,199.5,197.0,2,117,1.4,115,1.4,209,1.1,210,1.7",
        @"117,花园桥,212.0,196.5,2,118,1.2,116,1.4",
        @"118,白石桥南,227.0,197.0,2,119,1.6,117,1.2,167,0.9,60,1.1",
        @"119,车公庄西,247.0,197.0,2,50,0.9,118,1.6",
        @"120,北海北,305.5,197.0,2,121,1.4,63,1.2",
        @"121,南锣鼓巷,322.5,197.5,2,89,1.9,120,1.4",
        @"122,东大桥,380.0,205.0,2,123,0.8,41,1.5",
        @"123,呼家楼,394.5,205.5,2,124,1.4,122,0.8,191,1.1,192,0.6",
        @"124,金台路,412.0,205.0,2,125,1.9,123,1.4,227,2.3",
        @"125,十里堡,427.5,205.0,2,126,1.3,124,1.9",
        @"126,青年路,440.0,204.5,2,127,3.9,125,1.3",
        @"127,褡裢坡,457.0,205.0,2,128,1.2,126,3.9",
        @"128,黄渠,470.0,205.0,2,129,1.7,127,1.2",
        @"129,常营,480.5,204.5,2,130,1.5,128,1.7",
        @"130,草房,493.0,204.5,2,131,2.1,129,1.5",
        @"131,物资学院路,503.0,204.5,2,132,2.6,130,2.6",
        @"132,通州北关,518.5,208.0,2,133,3,131,2.6",
        @"133,北运河西,533.0,222.5,2,134,2.5,132,3",
        @"134,郝家府,549.0,222.0,2,135,1.3,133,2.5",
        @"135,东夏园,558.0,222.5,2,136,1.2,134,1.3",
        @"136,潞城,567.5,222.5,2,135,1.2",
        @"137,朱辛庄,273.0,88.5,2,138,2.3,155,3.8,156,2.4",
        @"138,育知路,284.5,88.5,2,139,2.0,137,2.3",
        @"139,平西府,299.5,88.5,2,140,1.9,138,2.0",
        @"140,回龙观东大街,307.5,94.5,2,141,1.0,139,1.9",
        @"141,霍营,307.5,105.5,2,142,1.7,140,1.0,217,2.0,99,4.8",
        @"142,育新,307.5,111.0,2,143,1.5,141,1.7",
        @"143,西小口,307.5,116.0,2,144,1.0,142,1.5",
        @"144,永泰庄,307.5,121.0,2,145,2.4,143,1.0",
        @"145,林萃桥,312.5,124.0,2,146,2.7,144,2.4",
        @"146,森林公园南门,318.0,128.0,2,147,1.1,145,2.7",
        @"147,奥林匹克公园,317.5,133.0,2,148,1.7,146,1.1,238,2.0,239,1.4",
        @"148,奥体中心,317.0,141.0,2,149,1.0,147,1.7",
        @"149,北土城,318.0,150.0,2,150,0.9,148,1.0,184,1.0,185,0.9",
        @"150,安华桥,317.5,157.5,2,36,2.3,149,0.9",
        @"151,什刹海,317.5,185.5,2,36,1.1,121,1.0",
        @"152,南邵,272.5,58.0,2,153,5.4",
        @"153,沙河高教园,273.0,65.0,2,154,1.9,152,5.4",
        @"154,沙河,273.0,72.5,2,155,2.0,153,1.9",
        @"155,巩华城,273.0,80.0,2,137,3.8,154,2.0",
        @"156,生命科学园,262.5,96.5,2,137,2.4,157,5.4",
        @"157,西二旗,262.0,112.0,2,156,5.4,215,2.5,216,3.6",
        @"158,郭公庄,203.0,298.5,2,159,1.3,168,1.3",
        @"159,丰台科技园,202.5,290.5,2,160,0.8,158,1.3",
        @"160,科怡路,203.0,282.5,2,161,0.9,159,0.8",
        @"161,丰台南路,203.0,275.0,2,162,1.6,160,0.9",
        @"162,丰台东大街,202.5,268.0,2,163,1.3,161,1.6",
        @"163,七里庄,202.5,256.0,2,164,1.7,162,1.3,226,1.5,207,0.8",
        @"164,六里桥,211.0,238.0,2,165,1.2,163,1.7,201,1.6,202,2.2",
        @"165,六里桥东,218.0,234.5,2,166,1.2,164,1.2",
        @"166,北京西站,225.0,229.5,2,8,1.4,165,1.2,251,0.9",
        @"167,白堆子,226.0,207.5,2,8,2.6,118,0.9",
        @"168,大葆台,196.5,306.5,2,169,6.4,158,1.3",
        @"169,稻田,190.0,313.5,2,170,4.0,168,6.4",
        @"170,长阳,184.0,319.5,2,171,2.1,169,4.0",
        @"171,篱笆房,177.5,325.5,2,172,1.4,170,2.1",
        @"172,广阳城,172.5,331.0,2,173,1.4,171,1.4",
        @"173,良乡大学城北,166.5,336.5,2,174,1.1,172,1.4",
        @"174,良乡大学城,159.0,344.0,2,175,1.7,173,1.1",
        @"175,良乡大学城西,147.5,344.0,2,176,1.3,174,1.7",
        @"176,良乡南关,131.5,343.5,2,177,1.3,175,1.3",
        @"177,苏庄,113.5,344.5,2,176,1.3",
        @"178,巴沟,200.5,152.0,2,179,1.0,212,1.4",
        @"179,苏州街,209.0,150.0,2,57,0.9,178,1.0",
        @"180,知春里,237.0,150.5,2,57,1.0,181,1.0",
        @"181,知春路,261.5,150.0,2,182,1.0,180,1.0,213,1.2,214,1.8",
        @"182,西土城,276.0,150.5,2,183,1.3,181,1.0",
        @"183,牡丹园,289.0,150.5,2,184,0.9,182,1.3",
        @"184,健德门,302.0,150.0,2,149,1.0,183,0.9",
        @"185,安贞门,331.0,150.0,2,149,0.9,94,0.9",
        @"186,芍药居,372.5,149.5,2,94,1.7,187,0.9,219,2.0,220,1.1",
        @"187,太阳宫,391.5,153.0,2,188,1.7,186,0.9",
        @"188,三元桥,395.5,163.5,2,189,1.4,187,1.7",
        @"189,亮马桥,395.0,173.0,2,190,0.8,188,1.4",
        @"190,农业展览馆,395.5,182.5,2,191,0.8,189,0.8",
        @"191,团结湖,394.5,192.0,2,123,1.1,190,0.8",
        @"192,金台夕照,395.0,211.0,2,123,0.6,19,0.9",
        @"193,双井,395.0,242.5,2,19,1.7,194,1.0,258,1.2,259,1.3",
        @"194,劲松,394.5,246.5,2,195,1.1,193,1.0",
        @"195,潘家园,395.0,252.0,2,196,1.1,194,1.1",
        @"196,十里河,395.5,257.5,2,197,1.6,195,1.1",
        @"197,分钟寺,392.0,270.5,2,198,0.9,196,1.6",
        @"198,成寿寺,374.0,275.0,2,83,1.6,197,0.9",
        @"199,石榴庄,334.0,275.5,2,83,1.2,200,1.3",
        @"200,大红门,320.0,275.0,2,201,1.0,199,1.3",
        @"201,角门东,306.5,275.0,2,70,1.2,200,1.0",
        @"202,草桥,269.0,275.0,2,70,1.5,203,1.6",
        @"203,纪家庙,254.0,275.5,2,204,1.1,202,1.6",
        @"204,首经贸,237.5,274.5,2,205,1.6,203,1.1",
        @"205,丰台站,224.0,275.0,2,206,0.9,204,1.6",
        @"206,泥洼,212.0,268.0,2,207,0.8,205,0.9",
        @"207,西局,212.0,257.5,2,164,1.6,206,0.8,163,0.8",
        @"208,莲花桥,212.0,229.0,2,164,2.2,7,1.0",
        @"209,西钓鱼台,205.5,207.0,2,7,2.2,116,1.1",
        @"210,车道沟,199.5,184.0,2,116,1.7,211,1.1",
        @"211,长春桥,199.0,172.5,2,212,0.9,210,1.1",
        @"212,火器营,199.0,161.0,2,178,1.4,211,0.9",
        @"213,大钟寺,261.5,165.5,2,34,2.8,181,1.2",
        @"214,五道口,262.5,138.0,2,181,1.8,215,4.8",
        @"215,上地,262.5,128.5,2,157,2.5,214,4.8",
        @"216,龙泽,274.5,104.5,2,157,3.6,217,1.3",
        @"217,回龙观,287.5,103.5,2,141,2.0,216,1.3",
        @"218,北苑,372.0,114.5,2,99,2.3,219,6.7",
        @"219,望京西,372.5,132.5,2,186,2.0,218,6.7,240,2.1,232,1.6",
        @"220,光熙门,373.0,162.5,2,186,1.1,221,1.1",
        @"221,柳芳,372.5,171.0,2,39,1.7,220,1.1",
        @"222,张郭庄,143.0,257.0,2,223,1.3",
        @"223,园博园,152.5,257.0,2,224,3.8,222,1.3",
        @"224,大瓦窑,164.0,257.5,2,225,1.2,223,3.8",
        @"225,郭庄子,174.5,257.0,2,226,1.9,224,1.2",
        @"226,大井,189.5,257.0,2,163,1.5,225,1.9",
        @"227,枣营,412.0,184.5,2,124,2.3,228,2.2",
        @"228,东风北桥,412.0,176.5,2,229,1.6,227,2.2",
        @"229,将台,411.5,169.5,2,230,1.9,228,1.6",
        @"230,望京南,408.5,149.5,2,231,1.2,229,1.9",
        @"231,阜通,401.5,142.0,2,232,0.9,230,1.2",
        @"232,望京,398.0,132.5,2,233,1.3,231,0.9,219,1.6,241,3.9",
        @"233,东湖渠,397.5,126.5,2,234,1.1,232,1.3",
        @"234,来广营,397.5,119.5,2,235,1.4,233,1.1",
        @"235,善各庄,397.5,112.0,2,234,1.4",
        @"236,清华东路西口,266.5,132.5,2,237,1.1",
        @"237,六道口,283.5,132.0,2,238,1.3,236,1.1",
        @"238,北沙滩,299.0,132.5,2,147,2.0,237,1.3",
        @"239,安立路,331.5,132.5,2,147,1.4,96,0.9",
        @"240,关庄,360.0,132.0,2,96,1.1,219,2.1",
        @"241,崔各庄,435.5,123.5,2,232,3.9,242,1.9",
        @"242,马泉营,436.0,114.5,2,243,3.3,241,1.9",
        @"243,孙河,436.0,105.0,2,244,3.3,242,3.3",
        @"244,国展,436.0,97.0,2,245,1.6,243,3.3",
        @"245,花梨坎,435.5,87.5,2,246,3.3,244,1.6",
        @"246,后沙峪,436.0,78.0,2,247,4.5,245,3.3",
        @"247,南法信,453.5,74.0,2,248,2.6,246,4.5",
        @"248,石门,476.5,73.5,2,249,1.3,247,2.6",
        @"249,顺义,498.0,73.5,2,250,2.9,248,1.3",
        @"250,俸伯,523.0,73.5,2,249,2.9",
        @"251,湾子,238.0,241.5,2,166,0.9,252,0.7",
        @"252,达官营,254.5,241.5,2,253,1.9,251,0.7",
        @"253,广安门内,272.5,241.5,2,66,1.4,252,1.9",
        @"254,虎坊桥,307.0,242.0,2,66,0.9,255,1.2",
        @"255,珠市口,319.0,242.0,2,256,0.9,254,1.2",
        @"256,桥湾,332.5,242.0,2,87,1.0,255,0.9",
        @"257,广渠门内,360.5,241.5,2,87,1.1,258,1.3",
        @"258,广渠门外,373.0,241.5,2,193,1.2,257,1.3",
        @"259,九龙山,410.5,241.5,2,193,1.3,260,0.8",
        @"260,大郊亭,423.5,241.5,2,261,0.9,259,0.8",
        @"261,百子湾,434.0,242.5,2,262,0.9,260,0.9",
        @"262,化工,436.5,248.0,2,263,1.5,261,0.9",
        @"263,南楼梓庄,436.5,253.5,2,264,0.9,262,1.5",
        @"264,欢乐谷景区,436.5,260.0,2,265,3.0,263,0.9",
        @"265,双合,447.5,263.0,2,266,1.0,264,3.0",
        @"266,焦化厂,458.5,263.5,2,265,1.0"


    };
    NSString* poidata[] ={
        @"苹果园@A出口,肯德基(苹果园店);D出口,北京射击馆;D出口,第1佳大鸡排(苹果园店);D出口,门头沟体育中心;",
        @"古城@A2出口,星座商厦;B1出口,风波庄;B1出口,珍饺坊(古城东街店);C1出口,长庚医院;C1出口,渔夫烤鱼;C出口,首钢篮球中心体育馆;",
        @"八角游乐园@A出口,老山体育健身中心;A出口,石景山游乐园;A出口,一麻一辣麻辣香锅;B2出口,石景山医院;B出口,石景山体育中心;",
        @"八宝山@C1出口,重庆刘一手;C2出口,比格比萨;C2出口,不二禅茶院;C2出口,旺顺阁鱼头泡饼店;D1出口,石景山万达广场;D2出口,中国中医科学院眼科医院;",
        @"玉泉路@A出口,金湘黔;B1出口,麻里麻里香锅;B2出口,仙仁城羊羯子;B出口,航天中心医院;C2出口,北京国际雕塑公园;C2出口,汉拿山;C出口,麦当劳;C出口,全聚德;",
        @"五棵松@A出口,武警总医院;A出口,武警总医院;B1出口,五棵松篮球馆;B出口,万事达中心;C1出口,阳光新生活广场;C1出口,卓展购物中心;C2出口,北京301医院;D2出口,必胜客;D2出口,陈阿婆(五棵松店);D2出口,呷哺呷哺;",
        @"万寿路@A出口,博雅宴府;B1出口,花家怡园;B1出口,凯德晶品购物中心;B1出口,松本楼日式烧肉;B1出口,太兴餐厅;C1出口,金莎苑酒楼;",
        @"公主坟@A1出口,城乡贸易中心;A1出口,翠微广场;A1出口,东来顺饭庄;A1出口,俏江南;A1出口,鲜境豆捞;A出口,百万庄园;A出口,城乡华懋商场;A出口,国美电器;B2出口,必胜客欢乐餐厅;B2出口,水利医院;B出口,凯德MALL;B出口,四川仁火锅;D出口,龙泽手机市场;D出口,苏宁电器;G出口,城乡贸易中心;",
        @"军事博物馆@A出口,军事博物馆;A出口,梅地亚中心牡丹厅;A出口,尚品日餐厅;A出口,小肥羊;A出口,裏頭餐厅;A出口,中国人民革命军事博物馆;A出口,中华世纪坛;A出口,中华世纪坛世界艺术馆;C出口,麦当劳;D出口,锦官居;D出口,亮堂品菜;",
        @"木樨地@B1出口,白云观;B1出口,锅里鲜锅贴;B1出口,金泰轩酒楼;B1出口,金太一品轩;B1出口,盛达园饭店;B1出口,首都博物馆;B出口,长安市场;C1出口,首都博物馆;",
        @"南礼士路@A出口,京味楼明苑店;B1出口,龙人居(南礼士路店);B出口,北京儿童医院;C出口,小田鸭烤鸭店;C出口,珍巷福地四合院菜馆;D1出口,富丽华大酒楼;D1出口,孔乙己酒楼(复兴门店);D2出口,广安体育馆;D2出口,红楼文化艺术博物馆;D出口,东来顺饭庄;D出口,广电国际酒店西餐厅;",
        @"复兴门@A出口,北京儿童医院;A出口,北京金都假日酒店;A出口,京味楼;A出口,四川大厦;B出口,百盛购物中心;B出口,北京市二龙路医院;B出口,北京协和医院西院;B出口,草菁菁时尚火锅店;B出口,麦当劳;C出口,长安商场;C出口,复兴商业城;C出口,金融街购物中心;D出口,黄鹤楼;D出口,孔乙己酒楼(复兴门店);",
        @"西单@A出口,贵宾楼饭店;A出口,华威商场;A出口,老佛爷百货;A出口,麦当劳;A出口,民族文化宫;A出口,民族文化宫博物馆;A出口,文府大厨;A出口,西单文化广场;B出口,仙踪林(北京西单店);B出口,呷哺呷哺;D出口,北京音乐厅;F1出口,汉光百货;F1出口,君太百货;F1出口,鹿港小镇(西单店);F1出口,西单大悦城;F1出口,西单购物中心;F1出口,西单商场;F2出口,北京市二龙路医院;",
        @"天安门西@B出口,中山公园音乐堂;C出口,国家大剧院;C出口,国家大剧院西餐厅;C出口,中山公园;C出口,鄱阳湖人家西单店;",
        @"天安门东@B出口,DOMUS;B出口,德云社剧场;B出口,故宫博物院;B出口,皇城根遗址公园;B出口,皇城食府;B出口,天地一家;B出口,天趣园;B出口,自然博物馆;B出口,菖蒲河公园;D出口,国家博物馆;F1出口,威尔美餐;",
        @"王府井@A出口,东方广场;A出口,金帆音乐厅;A出口,俏江南(东方广场店);A出口,上海小南国;A出口,时时乐(方广场餐厅);A出口,王府井步行街;A出口,王府井古人类文化遗址博物馆;A出口,西堤牛排;A出口,中国儿童剧场;F1出口,北京apm购物中心;F1出口,晨曦百货(新天地店);F1出口,东安市场;F1出口,东方新天地;F1出口,金宝汇购物中心;F1出口,乐天银泰百货;F1出口,王府井百货;",
        @"东单@A出口,百老汇影城用房广场店;A出口,北京饭店;A出口,北京协和医院;A出口,东方广场;A出口,东方新天地;A出口,好苑建国酒店亚洲厨房;A出口,君悦大酒店;A出口,乐天银泰百货;A出口,麦当劳;A出口,内蒙古驻京办餐厅;A出口,俏江南;A出口,太兴餐厅(东方广场店);A出口,先锋剧场;A出口,协和医院;B出口,国际饭店;B出口,汉庭酒店;B出口,好苑建国饭店;B出口,小樽日本料理;B出口,中纺大厦;B出口,中国妇女儿童博物馆;B出口,中国交通运输部;B出口,中国农业银行;B出口,中国邮政储蓄东单邮政支局;B出口,中华全国妇女联合会;C出口,宁郡王府;C出口,全季酒店(东单店);C出口,唐宫海鲜舫(好苑店);D出口,东单体育中心;D出口,同仁医院;",
        @"建国门@A出口,长安大戏院;A出口,江户川日本料理;A出口,银泰中心;A出口,友谊商店;A出口,渝信川菜;A出口,中国邮政邮票博物馆;B出口,儿研所;B出口,和睦家医院;B出口,赛特购物中心;B出口,同仁验光配镜;B出口,鸭王烤鸭店;B出口,渝信川菜;C出口,北京古观象台;C出口,北京同济医院;C出口,恒基中心;C出口,明城五号烤鸭坊;C出口,御香苑;E2出口,国贸商城;",
        @"永安里@A出口,秀水街;B出口,北京建国饭店;B出口,环球金融中心;B出口,麦当劳;B出口,万方豆捞;B出口,呷哺呷哺;C出口,日坛公园;C出口,双子座购物中心;C出口,随园食客;C出口,坛子村韩国料理;C出口,乌衣小居徽菜馆;C出口,呷哺呷哺;",
        @"国贸@A出口,财富中心;A出口,建外SOHO;A出口,建外SOHO;A出口,俏江南(国贸店);A出口,秀水;A出口,中海广场;A出口,中海广场;A出口,羲和雅苑烤鸭坊;B出口,麦当劳;B出口,万达广场;C出口,北京银泰中心;C出口,财富购物中心;C出口,光华路SOHO;C出口,金地广场;C出口,穗高日本料理;D出口,豪上豪牛排馆;E2出口,世贸天阶;F出口, 小肥羊;F出口,慈铭体检中心;F出口,麦乐迪;G出口, 天禧火锅(国贸店);G出口,万达广场;G出口,渝乡人家(国贸店);",
        @"大望路@A出口,3912bar;A出口,旺顺阁鱼头泡饼;A出口,竹林诗语(华贸店);B出口,将太无二;B出口,新光天地;B出口,新世界百货;B出口,耀莱新天地;C出口,汉江秀麻辣香锅;C出口,和饮轮饮休闲吧;C出口,华贸购物中心;C出口,伦巴萨艺术餐厅;D出口,万达广场;D出口,沃尔玛购物广场建国路分店;",
        @"四惠@A出口,海龙鲜（百子湾店）;A出口,麦当劳;C1出口,四惠商城;C1出口,栀子花开茶餐厅;D出口, 小渔港(四惠店);E出口, 味百年港式餐厅;E出口,枫铃日本料理;",
        @"四惠东@A出口,四惠商场;A出口,中国紫檀博物馆;B出口,尚8里文创园;",
        @"西直门@A出口,PANKOO釜山料理;A出口,东来顺;A出口,福成肥牛西城店;A出口,华堂商场(西外店);A出口,西堤牛排;B出口,世纪谭府酒楼;D出口,北大人民医院;D出口,东方沪园大酒楼;D出口,锅色天香;D出口,凯德MALL(西直门店);D出口,展览路医院;",
        @"积水潭@A出口,必胜客欢乐餐厅;A出口,二炮总医院;A出口,兰庭玉树四合茶餐院;A出口,山釜餐厅;B出口,北京古代钱币博物馆;B出口,解放军歌剧院;B出口,宋庆龄故居;C出口,积水潭医院;C出口,新华百货;C出口,徐悲鸿纪念馆;C出口,呷哺呷哺;",
        @"鼓楼大街@A1出口,金能源大酒楼;A2出口,湘彬酒店;B出口,北京同康医院;B出口,胡杨咖啡厅;B出口,渔老俵鱼府;B出口,原鼎法式铁板烧;B出口,云麓轩;E出口,北京明都中医院;E出口,东联大厦;F出口,汉华国际饭店;G出口,丽江庭院之柔软时光;",
        @"安定门@A出口,北京永安中医医院;A出口,筋头巴脑;A出口,三利百货;B出口,藏红花西餐厅;B出口,地坛体育中心;B出口,南门涮肉(河边店);",
        @"雍和宫@A1出口,56号院;A1出口,大明府;A出口, 灿都餐吧;A出口,The VEGGIE TABLE;A出口,Vineyard Cafe;A出口,藏红花西餐厅;A出口,人才市场;A出口,沙卵石西餐屋;A出口,糖果俱乐部;A出口,星光现场音乐厅;C出口,孔庙和国子监博物馆;D出口,京兆尹Kings joy Beijing;",
        @"东直门@A出口,彼得堡西餐厅;A出口,福惠龙;A出口,花家怡园(簋街店);A出口,老井俄式餐厅;A出口,中国中医科学院针灸医院;B出口,北京济仁中医骨病医院;B出口,广宁中医院;B出口,自来水博物馆;C出口,东环广场;C出口,蜂巢剧场;C出口,国盛商场;C出口,银座百货;D出口,北京市东城区东外医院;D出口,北京中医药大学东直门医院;D出口,豆捞坊(东直门店);D出口,九头鹰酒家;D出口,来福士购物中心;D出口,中国医史博物馆;D出口,中国中医研究院骨伤科医院;",
        @"东四十条@A出口,大董烤鸭店;A出口,将太无二;A出口,三只耳冷锅鱼;B出口,保利大厦国际剧院;B出口,天地剧场;C出口,工人体育场;C出口,工人体育馆;D出口,中国人民解放军北京军区总医院;",
        @"朝阳门@A出口,北京民俗博物馆;A出口,朝外SOHO;A出口,丰联广场;A出口,金汉斯(朝阳店);A出口,昆泰商城;A出口,蓝岛大厦(朝阳店);A出口,俏江南(丰联店);A出口,小肥羊(朝阳门店);A出口,新沸腾鱼乡;A出口,渝乡人家川菜馆;F出口,东四民芳餐厅;G出口,凯恒中心;G出口,银河SOHO;",
        @"建国门@A出口,长安大戏院;A出口,江户川日本料理;A出口,银泰中心;A出口,友谊商店;A出口,渝信川菜;A出口,中国邮政邮票博物馆;B出口,儿研所;B出口,和睦家医院;B出口,赛特购物中心;B出口,同仁验光配镜;B出口,鸭王烤鸭店;B出口,渝信川菜;C出口,北京古观象台;C出口,北京同济医院;C出口,恒基中心;C出口,明城五号烤鸭坊;C出口,御香苑;E2出口,国贸商城;",
        @"北京站@A出口,香港老饭店;B出口,恒基商城;B出口,金百万（恒基店）;B出口,万家禧年家常菜;C出口,银鱼盆餐厅;C出口,中粮广场购物中心;",
        @"崇文门@A1出口,北京同仁堂中医医院;A1出口,北京医院;A2出口,唐宫海鲜舫;A2出口,喜多屋日本料理;A出口,搜秀城;A出口,同仁医院;A出口,咩咩羊火锅店;B出口,花家怡园(八爷府王府井店);B出口,新侨三宝乐西餐厅;C1出口,国瑞购物中心;C出口,淮扬村饭庄;C出口,科力淮扬村;C出口,马克西姆餐厅;C出口,蓬莱阁中餐厅;C出口,普仁医院;C出口,西堤牛排;C出口,新世界百货;D出口,新世界百货;D出口,新世界商场;",
        @"前门@A出口,大方百货商店;A出口,大栅栏购物中心;A出口,东来顺饭庄;A出口,花马天堂云南餐厅;A出口,警察博物馆;A出口,毛主席纪念堂;A出口,前门步行街;A出口,世纪天鼎购物广场;A出口,先农坛体育中心;A出口,中国法院博物馆;A出口,中国钱币博物馆;B出口,北京市规划展览馆;B出口,金宅门烤鸭店;B出口,老北京炸酱面;B出口,全聚德;B出口,永隆酒家;B出口,中国铁道博物馆;B出口,中和戏院;C出口,大观楼影城;C出口,广德楼戏园;C出口,老舍茶馆;C出口,天桥剧场;C出口,中华电影娱乐宫;",
        @"和平门@A出口,北京棋院;C1出口,全聚德;C1出口,升福圃酒家;C1出口,正乙祠戏楼;C2出口,友谊医院;C出口,北京天坛医院;D1出口,两湖轩;D2出口,北京急救中心;D2出口,觉品壹号;D出口,北京戏曲博物馆;D出口,湖广会馆;D出口,梨园剧场;",
        @"宣武门@A出口,北喜日式料理;A出口,西堤牛排;A出口,宣武门天主堂;B1出口,北京市第二医院;B出口,德外医院;C出口,老城南;C出口,庄胜崇光百货;D出口,彩云之滇云南菜馆;G出口,西堤牛排;G出口,紫园食府;",
        @"长椿街@A1出口,北京闹市口医院;A2出口,大观园戏楼;A2出口,中央音乐学院音乐厅;A出口,喜多屋;B1出口,华天马凯餐厅;B2出口,李大钊故居;C2出口,北京市宣南文化博物馆;C出口,富卓大厦;C出口,国华商场;D1出口,北京广安门中医院;D1出口,天府家常菜;D1出口,宣武医院;D1出口,中国消防博物馆;",
        @"复兴门@A出口,北京儿童医院;A出口,北京金都假日酒店;A出口,京味楼;A出口,四川大厦;B出口,百盛购物中心;B出口,北京市二龙路医院;B出口,北京协和医院西院;B出口,草菁菁时尚火锅店;B出口,麦当劳;C出口,长安商场;C出口,复兴商业城;C出口,金融街购物中心;D出口,黄鹤楼;D出口,孔乙己酒楼(复兴门店);",
        @"阜成门@A出口,必胜客欢乐餐厅;A出口,阜外心血管病医院;A出口,韩一味(阜成门店);A出口,华联商厦(阜成门店);A出口,鲁迅博物馆;A出口,天意新商城(阜外店);A出口,厅官园中餐厅;A出口,万通商城;B出口,鲁迅博物馆;B出口,新世界商品交易市场;B出口,月坛体育馆;C出口,白塔寺博物馆;C出口,北京大学人民医院;C出口,北京丰盛中医骨伤专科医院;C出口,全国政协礼堂保龄球馆;D出口,拿渡;",
        @"车公庄@A出口,北京人民医院;A出口,珠宝城;B出口,青年宫剧场;B出口,中国儿童中心;C出口,鲍鱼王子南国苑;C出口,国家京剧院;C出口,梅兰芳大剧院;C出口,食神锅奉行;C出口,太和文华食府;C出口,粤海湘天;E出口,官员批发市场;H出口,华天峨嵋酒家;H出口,三味缘(官园店);",
        @"安河桥北@A出口,华联商厦;A出口,麟丰鸭源;B出口,和风细雨悦食汇;B出口,仁和静雅饭店;B出口,新辣道鱼火锅;",
        @"北宫门@A1出口,北京逍遥园餐厅;A1出口,肯德基;A1出口,麦当劳;A1出口,平壤海棠花;A1出口,西贝西北菜;A2出口,木栅烤涮馆;C出口,潮好味(颐和园店);",
        @"西苑@B出口,北京康乐医院;C1出口,龙湖星悦荟;C1出口,西苑商城;C1出口,云海肴亭云幸福馆;C1出口,中国中医科学院西苑医院;C1出口,呷哺呷哺;C2出口,吉野家;C2出口,吞云小莳;",
        @"圆明园@A出口,大益膳房;A出口,三本木町;A出口,中发百旺商城;C出口,梦桃源湘粤酒楼;C出口,直隶会馆;",
        @"北京大学东门@A出口,徽菜馆;A出口,竹鱼坊(北大总店);C出口,中关新园餐厅;",
        @"中关村@A出口,干锅派(鼎好店);A出口,万贸购物中心;C1出口,汉丽轩;C2出口,呷哺呷哺;D出口,和合谷(海龙店);D出口,吉野家;D出口,麻辣诱惑;D出口,欧美汇购物中心;D出口,赛百味(海龙店);D出口,新中关购物中心;D出口,中关村广场购物中心;",
        @"海淀黄庄@A1出口,海淀医院;A2出口,汉拿山;A出口,海淀剧院;A出口,权金城;B出口,北京市海淀区博物馆;B出口,必胜客欢乐餐厅;B出口,海淀剧场;C1出口,北京市海淀区博物馆;C1出口,吉野家;C1出口,暖山咖啡;D出口,比格比萨;D出口,九头鹰酒家;D出口,麦当劳;",
        @"人民大学@A2出口,当代商城;B出口,黑森林烤鱼部落;B出口,六合人家;C出口,禾绿回转寿司;C出口,零度空间;C出口,品味中西餐烤肉;C出口,双安商场;C出口,呷哺呷哺;D出口,欢乐杰巴西烤肉;",
        @"魏公村@D出口,东方饺子王;D出口,吉野家;D出口,嘉和一品;D出口,金汉斯(中关村店);D出口,刘家香;D出口,蜀正园(魏公村店);D出口,渔贵妃酸汤鱼;D出口,潇湘味道;",
        @"国家图书馆@A出口,国家图书馆嘉言堂音乐厅;A出口,锦府盐帮酒楼;B出口,北京石刻艺术博物馆;B出口,富锦天酒楼;B出口,蜀乡竹林;B出口,湘彬食府;B出口,燕兰楼;C出口,首都体育馆;D出口,紫晶宴府;",
        @"动物园@A出口,东方银尊酒楼;A出口,九头鹰酒家;A出口,渔风尚烤鱼坊;B出口,北展剧场;C出口,大粥锅;C出口,华堂商场;C出口,天和白马商城;C出口,虾捞哺涮涮锅;C出口,新世纪日航饭店商场;C出口,一品三笑;D出口,北京天食坊美食;D出口,北京天文馆;D出口,元沃天地地铁商城;D出口,中国古动物馆;",
        @"西直门@A出口,PANKOO釜山料理;A出口,东来顺;A出口,福成肥牛西城店;A出口,华堂商场(西外店);A出口,西堤牛排;B出口,世纪谭府酒楼;D出口,北大人民医院;D出口,东方沪园大酒楼;D出口,锅色天香;D出口,凯德MALL(西直门店);D出口,展览路医院;",
        @"新街口@A出口,丽江龙记斑鱼庄;A出口,洼里医院;B出口,1/2茶餐厅;B出口,乌江鱼锅;C出口,百叶居;C出口,红辣辣酒楼;D出口,万州烤鱼;",
        @"平安里@A出口,天赐庄园(厂桥店);B出口,梅兰芳纪念馆;B出口,人民剧场;B出口,陶香小馆;C出口,北京中医药大学附属护国寺中医医院;C出口,京味楼;C出口,赖永初酒楼;C出口,天福号;E出口,平安医院;E出口,平安医院;F出口,北京按摩医院;F出口,护国寺中医医院;F出口,人民剧场;G出口,北京天乐医院;H出口,北京不孕不育专科医院;H出口,北京家圆医院;",
        @"西四@A出口,惠丰老北京饺子楼;A出口,聚香园;A出口,历代帝王庙;B出口,皇城东坡;B出口,天下江南;B出口,一品骨香;D出口,中国地质博物馆;",
        @"灵境胡同@A出口,国味堂粥店;C出口,巴黎老佛爷百货;C出口,胡子老爹;C出口,牛先生火锅店;C出口,五福楼饭庄;C出口,西单鱼库;D出口,北京协和医院西院;",
        @"西单@A出口,贵宾楼饭店;A出口,华威商场;A出口,老佛爷百货;A出口,麦当劳;A出口,民族文化宫;A出口,民族文化宫博物馆;A出口,文府大厨;A出口,西单文化广场;B出口,仙踪林(北京西单店);B出口,呷哺呷哺;D出口,北京音乐厅;F1出口,汉光百货;F1出口,君太百货;F1出口,鹿港小镇(西单店);F1出口,西单大悦城;F1出口,西单购物中心;F1出口,西单商场;F2出口,北京市二龙路医院;",
        @"宣武门@A出口,北喜日式料理;A出口,西堤牛排;A出口,宣武门天主堂;B1出口,北京市第二医院;B出口,德外医院;C出口,老城南;C出口,庄胜崇光百货;D出口,彩云之滇云南菜馆;G出口,西堤牛排;G出口,紫园食府;",
        @"菜市口@A出口,品鸭上苑;C出口,渤海湾小海鲜;D出口,爆肚冯(菜市口店);D出口,戈拿旺巴西烤肉;D出口,千禧园城一锅;",
        @"陶然亭@A出口,健宫医院;A出口,喀什饭庄;A出口,醉香苑四季涮肉;A出口,鑫隆四季涮肉;C出口,回民医院;C出口,蟹岛老五四季涮肉;C出口,雅韵然食府;D出口,乐秀商城;D出口,湘桂人(陶然亭店);",
        @"北京南站@A出口,吉野家;A出口,麦当劳;A出口,仙踪林;A出口,永和大王;A出口,正一味(北京南站店);B出口,汉堡王;C出口,晋乡村落;C出口,南城香;",
        @"马家堡@A出口,大糖梨烤鸭店;A出口,首地大峡谷购物中心;A出口,仙踪林;B出口,权金城权品火锅;B出口,万芳亭网球馆;C出口,北京博爱医院;C出口,权品川式火锅;",
        @"角门西@A出口,棒约翰;A出口,金百万;A出口,金汉斯;A出口,土大力;E出口,北京红旗精神病医院;E出口,必胜客欢乐餐厅;E出口,拾味馆;E出口,天外天烤鸭店;",
        @"公益西桥@A出口,安太医院;A出口,五谷老妈;B出口,昂歌乐玛特色文化演绎饭店;B出口,黄记煌三汁焖锅;B出口,回味九格;B出口,陕亿边;B出口,蜀风阁巫山碳烤全鱼;B出口,鱼打头;B出口,渝乡情;C出口,华冠天地;D出口,BHG Mall;D出口,华联商厦;",
        @"宋家庄@C出口,嘉和一品;D出口,九天食府;D出口,扑满山大厦;D出口,尚贤居餐厅;D出口,石榴庄社区卫生服务站;D出口,呷哺呷哺;",
        @"刘家窑@A出口,3000浦时尚火锅烤肉餐厅;A出口,中国评剧院;B出口,健将一品粥(刘家窑店);B出口,乐购仕生活广场;B出口,味妙烤鱼吧;C出口,春饼烤鸭店;C出口,东森时尚百货;C出口,江西大酒店;C出口,芦月轩羊蝎子火锅;C出口,南北俪琬;C出口,铁营医院;C出口,蟹老宋;D出口,川太公;",
        @"蒲黄榆@A出口,蒲黄榆羊蝎子;B出口,南北一家;B出口,三只耳(方庄店);B出口,天多小火锅;B出口,土大力;B出口,物美超市;B出口,新城广场;B出口,重庆秦妈火锅;C出口,北京中医药大学东方医院;C出口,博纳影城;C出口,麻辣精灵(方庄店);C出口,中央音乐学院附中;D出口,阿达西餐厅NO.6;D出口,百荣;",
        @"天坛东门@A1出口,好伦哥;A1出口,私房小厨;A2出口,红桥市场;A出口,东华医院;B出口,北京体育馆;B出口,国家体育总局网球运动管理中心;B出口,麦田餐饮;B出口,天坛体育馆;C出口,圣德保酒店;C出口,首府饭店;C出口,天坛体育场;D出口,全鑫园烤鸭店;",
        @"磁器口@A出口,北京两广中医医院;A出口,江南龙港酒楼;A出口,天苑阁;A出口,正仁大厦;B出口,普仁医院;B出口,田记串串香重庆火锅;D出口,春福来;D出口,万商汇淘宝城;",
        @"崇文门@A1出口,北京同仁堂中医医院;A1出口,北京医院;A2出口,唐宫海鲜舫;A2出口,喜多屋日本料理;A出口,搜秀城;A出口,同仁医院;A出口,咩咩羊火锅店;B出口,花家怡园(八爷府王府井店);B出口,新侨三宝乐西餐厅;C1出口,国瑞购物中心;C出口,淮扬村饭庄;C出口,科力淮扬村;C出口,马克西姆餐厅;C出口,蓬莱阁中餐厅;C出口,普仁医院;C出口,西堤牛排;C出口,新世界百货;D出口,新世界百货;D出口,新世界商场;",
        @"东单@A出口,百老汇影城用房广场店;A出口,北京饭店;A出口,北京协和医院;A出口,东方广场;A出口,东方新天地;A出口,好苑建国酒店亚洲厨房;A出口,君悦大酒店;A出口,乐天银泰百货;A出口,麦当劳;A出口,内蒙古驻京办餐厅;A出口,俏江南;A出口,太兴餐厅(东方广场店);A出口,先锋剧场;A出口,协和医院;B出口,国际饭店;B出口,汉庭酒店;B出口,好苑建国饭店;B出口,小樽日本料理;B出口,中纺大厦;B出口,中国妇女儿童博物馆;B出口,中国交通运输部;B出口,中国农业银行;B出口,中国邮政储蓄东单邮政支局;B出口,中华全国妇女联合会;C出口,宁郡王府;C出口,全季酒店(东单店);C出口,唐宫海鲜舫(好苑店);D出口,东单体育中心;D出口,同仁医院;",
        @"灯市口@A出口,1949-全鸭季(金宝街店);A出口,北京王府井医院;A出口,北京中新颐和医院;A出口,大董烤鸭店(金宝汇店);A出口,金宝汇购物中心;A出口,利苑酒家(金宝店);A出口,苏浙汇(澳门中心店);B出口,诺富特和平宾馆卡本妮法餐厅;C出口,丽晶酒店;C出口,励骏酒店;C出口,米市商场;",
        @"东四@A出口,阿火云南味道;A出口,华表商场;A出口,美年中医院;A出口,然寿司(钱粮胡同店);A出口,中国美术馆;A出口,忒食;B出口,东四涮肉馆;B出口,福地凰城酒店;B出口,三友商场;C出口,北京财贸职业学院东四校区;C出口,朝阳门医院;D出口,北京人民艺术剧院;D出口,北京人艺实验剧场;D出口,北京人艺小剧场;E出口,白魁老号饭庄;E出口,福隆医院;E出口,富隆寺大厦;G出口,豆花香辣蟹;G出口,三友商场;",
        @"张自忠路@A出口,Fourteen 西餐厅;A出口,翻滚的辣椒;A出口,孔乙己酒楼(东四店);A出口,老诚一锅;A出口,平安大酒楼;A出口,文天祥祠;A出口,屋里厢;A出口,银杏府;C出口,八一儿童医院;C出口,北京健行中医医院;C出口,东四医院;D出口,北京当代女子医院;D出口,北京中医院;D出口,福隆医院;D出口,蓝色火宴自助烤肉;D出口,同力医院;",
        @"北新桥@A出口,首都医科大学中医药学院附属医院;A出口,香天下传承(交道口店);A出口,晓林火锅;B出口,胡大饭馆;B出口,花家怡园;B出口,云游驿;C出口,北京市第六医院;C出口,北京市东城区北新桥医院;C出口,成大商场;C出口,花家怡园(四合院总店);C出口,己未空间;D出口,华侨饭店;D出口,茅盾故居;",
        @"雍和宫@A1出口,56号院;A1出口,大明府;A出口, 灿都餐吧;A出口,The VEGGIE TABLE;A出口,Vineyard Cafe;A出口,藏红花西餐厅;A出口,人才市场;A出口,沙卵石西餐屋;A出口,糖果俱乐部;A出口,星光现场音乐厅;C出口,孔庙和国子监博物馆;D出口,京兆尹Kings joy Beijing;",
        @"和平里北街@A1出口,和平里医院;A2出口,海福湾大酒楼;A2出口,天丰利市场;B出口,东城中医院;B出口,和平里大酒店;B出口,玛丽妇婴医院;B出口,煤炭医院;B出口,云柏鞋业;C出口,芭夯兔;C出口,第五俱乐部;C出口,沸腾夜话;C出口,豪尚豪牛排馆;C出口,金百万;C出口,丝路印象新疆文化餐厅;D出口,北京天安中医医院;D出口,地坛体院馆;D出口,金米兰酒店;D出口,金米兰酒楼;D出口,天安中医院;",
        @"和平西桥@A出口,安贞医院;A出口,好姐妹炭烤羊腿;A出口,品正品茶餐厅;A出口,咸亨酒店;B出口,贵州大厦贵州厅;B出口,金鸡百花影城;B出口,湘良友水鱼;",
        @"惠新西街南口@A出口,北京藏医院;B出口,北平楼(惠新里店);B出口,惠新里小学;B出口,首尔城;B出口,通联大厦;C出口,大亨酒家;C出口,大同江会馆;C出口,海福羊火锅;C出口,辣婆婆;C出口,老诚一锅(中日店);C出口,皖南水乡;C出口,中日友好医院;C出口,中日友好医院;",
        @"惠新西街北口@A出口,北京剧场;A出口,彩虹之约(亚运村店);A出口,李老爹香辣蟹;A出口,唐都酒楼;A出口,唐宫海鲜舫;A出口,西藏文化博物馆;A出口,印巷小馆(亚运村店);B出口,北奥大厦;B出口,必胜客欢乐餐厅;B出口,华堂商场;C出口,黄果树酸汤鱼;C出口,清香阁大连海鲜;C出口,物美大卖场;C出口,中国现代文学馆;",
        @"大屯路东@A1出口,海纳好运海鲜酒楼;A1出口,金鼎轩(亚运村店);A1出口,金泉广场;A1出口,曲美家具;A1出口,炎黄艺术馆;A2出口,便宜坊烤鸭店;A2出口,东来顺;A2出口,贵州箩箩酸汤鱼;A2出口,海底捞大屯路店;A2出口,将太无二;A2出口,山里江南;B1出口,上品折扣亚奥旗舰店;B2出口,颐康中医院;",
        @"北苑路北@A1出口,卜蜂莲花超市;A1出口,民福小馆;A2出口,北辰购物中心;A2出口,必胜客;A2出口,蕾尔咖啡茶餐厅;A2出口,天使妇儿医院;A2出口,湘西土菜;A2出口,妫水人家;B1出口,K酷时尚广场;B1出口,华堂商场;B1出口,新辣道鱼火锅;B2出口,北京星兆老年病医院;B2出口,航空总医院;B2出口,潇湘甲鱼村;",
        @"立水桥南@A出口,乐购仕生活广场;A出口,苏宁;C出口,安全大厦;C出口,北平楼;C出口,北苑物美;C出口,东来顺;C出口,独一味万州烤鱼;C出口,环境科学院;C出口,眉州东坡酒楼;C出口,易事达广场;D出口,北京京顺医院;D出口,华堂商场;D出口,领地OFFICE;D出口,拿渡麻辣香锅;D出口,瑞尔口腔医院;",
        @"立水桥@A出口,北京万和颈椎病医院;A出口,川禾轩烤鱼坊;A出口,川珍珍火锅;A出口,京福华肥牛;A出口,顺满堂;A出口,万意商城;B1出口,锦绣年华酒楼;B1出口,龙德广场;",
        @"天通苑南@A出口,大鸭梨;A出口,第一锅羊蝎子火锅;A出口,黄记煌;A出口,辣道家;A出口,老北平食府;A出口,龙德商场;A出口,品湘楼;A出口,天通苑中医医院;A出口,西单商场天通苑购物中心;A出口,小肥羊;",
        @"天通苑@A出口,旺顺阁鱼头泡饼;B出口,大鸭梨;B出口,国泰广场;B出口,航空医院门诊部;B出口,航空总医院天通苑门诊部;B出口,龙门鱼府;B出口,天通尾货;B出口,盈景园;",
        @"天通苑北@A出口,亚运村汽车交易市场;B出口,豫军缘火锅城;",
        @"海淀五路居@C出口,天目湖会馆;C出口,馥天下烤鸭店;",
        @"慈寿寺@C出口,华普超市;H出口,点点心食坊;",
        @"花园桥@A出口,大同会馆;A出口,宏状元伸粥店;A出口,金陵会;A出口,李先生花园桥餐厅;B1出口,北京艺术博物馆;B1出口,中国剧院;C出口,九花山烤鸭店;",
        @"白石桥南@A出口,家中宝;A出口,香草香草云南原生态火锅;B出口,大宅门;B出口,老诚一锅;C出口,鼎鼎香;G出口,大鸭梨;G出口,芙蓉湾酒楼;",
        @"车公庄西@A出口,上海小南国;B出口,花花酒家;B出口,京味楼;B出口,丝路印象新疆餐厅;B出口,宴华园酒楼;C出口,阜外心血管病医院北楼;C出口,巫山烤全鱼;",
        @"车公庄@A出口,北京人民医院;A出口,珠宝城;B出口,青年宫剧场;B出口,中国儿童中心;C出口,鲍鱼王子南国苑;C出口,国家京剧院;C出口,梅兰芳大剧院;C出口,食神锅奉行;C出口,太和文华食府;C出口,粤海湘天;E出口,官员批发市场;H出口,华天峨嵋酒家;H出口,三味缘(官园店);",
        @"平安里@A出口,天赐庄园(厂桥店);B出口,梅兰芳纪念馆;B出口,人民剧场;B出口,陶香小馆;C出口,北京中医药大学附属护国寺中医医院;C出口,京味楼;C出口,赖永初酒楼;C出口,天福号;E出口,平安医院;E出口,平安医院;F出口,北京按摩医院;F出口,护国寺中医医院;F出口,人民剧场;G出口,北京天乐医院;H出口,北京不孕不育专科医院;H出口,北京家圆医院;",
        @"北海北@A出口,齐鲁饭店;A出口,水牛石;B出口,6.8酒吧;B出口,北大医院男科中心;B出口,北京大学第一医院;B出口,藏素风格餐厅;B出口,恭王府大戏楼;B出口,郭沫若纪念馆;B出口,甲丁坊;B出口,康铃声听力点门店;B出口,前海股骨头医院;B出口,全聚德烤鸭店(什刹海店);B出口,天水盈池;B出口,小王府(什刹海店);B出口,乙十六(北海御膳堂店);D出口,北大第一医院;D出口,解放军第309医院第一分医院;",
        @"南锣鼓巷@A出口,北京中医医院;A出口,北京中医医院;A出口,龙海鑫洗浴自助餐;A出口,中央戏剧学院实验剧场;A出口,逅泰厨;A出口,鲿鳗屋;B出口,Cambulac红酒坊;B出口,北海医院;B出口,北京中医院;B出口,都江源;B出口,涵珍园国际酒店餐厅;B出口,十八茶膳;B出口,束河人家;",
        @"东四@A出口,阿火云南味道;A出口,华表商场;A出口,美年中医院;A出口,然寿司(钱粮胡同店);A出口,中国美术馆;A出口,忒食;B出口,东四涮肉馆;B出口,福地凰城酒店;B出口,三友商场;C出口,北京财贸职业学院东四校区;C出口,朝阳门医院;D出口,北京人民艺术剧院;D出口,北京人艺实验剧场;D出口,北京人艺小剧场;E出口,白魁老号饭庄;E出口,福隆医院;E出口,富隆寺大厦;G出口,豆花香辣蟹;G出口,三友商场;",
        @"朝阳门@A出口,北京民俗博物馆;A出口,朝外SOHO;A出口,丰联广场;A出口,金汉斯(朝阳店);A出口,昆泰商城;A出口,蓝岛大厦(朝阳店);A出口,俏江南(丰联店);A出口,小肥羊(朝阳门店);A出口,新沸腾鱼乡;A出口,渝乡人家川菜馆;F出口,东四民芳餐厅;G出口,凯恒中心;G出口,银河SOHO;",
        @"东大桥@A出口,Face泰国餐厅;A出口,百脑汇;A出口,春平购物广场;A出口,春平购物广场;A出口,黑爵仕咖啡;A出口,镜湖国际公馆自助餐;A出口,坤太大厦;A出口,蓝岛大厦;A出口,蓝岛大厦;B出口,食全酒美湘菜馆;D1出口,Geba Geba;D1出口,OPERA BOMBANA;D1出口,建外SOHO;D1出口,万通中心;D1出口,一泉德(SOHO尚都店);D出口,SOHO尚都;D出口,北京东大肛肠医院;D出口,北京蓝海中医医院;D出口,北京专业胃肠科医院;D出口,侨福芳草地购物中心;D出口,世贸天阶;D出口,中认大厦;",
        @"呼家楼@A出口,藏三昧;A出口,大可食尚铁板烧;A出口,廿九阁;B出口,北京济华医院;B出口,福裕红铁板烧自助餐厅;B出口,三四郎日本料理;B出口,雍雅河鲜酒楼;B出口,圆苑(团结湖店);C2出口,朝阳剧场;C出口,安联大厦;C出口,朝阳剧场;C出口,雨霖大厦;D出口,SOHO&#8226;尚都;D出口,人民日报社医院;D出口,西单商场;E出口,Ishikawa;E出口,朝阳医院;E出口,嘉铭中心;E出口,团结湖大厦;G出口,环球金融中心;G出口,京广中心;G出口,渣打大厦;",
        @"金台路@B出口,必胜客(甜水园店);B出口,朝阳体育馆;B出口,华德眼科医院;B出口,柿子树炭烤羊腿;B出口,蝎王府羊蝎子;B出口,元亨烧肉;B出口,元气寿喜烧;B出口,正院大宅门海鲜花园;D出口,白百合焖锅火锅;D出口,黄枢中医医院;D出口,盛世楼饭庄;",
        @"十里堡@A出口,汉拿山(石佛营店);A出口,牛和牛韩式烤肉;B出口,草帽鱼;B出口,欢乐口腔朝阳分院;B出口,一二三串吧;C出口,丽景湾国际酒店西餐厅;D出口,北京维尔口腔医院;D出口,北京英智康复医院;D出口,山城辣妹子重庆火锅;D出口,昭阳湘菜;",
        @"青年路@B出口,朝阳大悦城;B出口,朝阳体育中心;B出口,赤坂亭;B出口,大渔铁板烧;B出口,滇草香云南原生态汤火锅;B出口,雕爷牛腩;B出口,金钱豹国际美食宴会厅;B出口,全聚德烤鸭店;B出口,西堤牛排;B出口,西堤牛排;",
        @"褡裢坡@B出口,鸿毛饺子;B出口,一洋食府;C出口,越来越湘;D出口,捌零烤鱼;D出口,傣妈米线;",
        @"黄渠@C出口,常营回民医院;C出口,萨拉伯尔;D出口,肯德基;D出口,欧尚大型超市;D出口,生活时间羽毛球馆;",
        @"常营@A出口,福成香悦四季;A出口,京客隆常营店;B出口,北京华联常营购物中心;B出口,避风港;B出口,便宜坊烤鸭店;B出口,鸿毛饺子;B出口,南锣肥猫;B出口,万象新天社区卫生站;B出口,新辣道鱼火锅;",
        @"草房@C出口,263医院;C出口,北京肺癌治疗中心;C出口,北京胸科医院;",
        @"物资学院路@",
        @"通州北关@",
        @"北运河西@",
        @"郝家府@",
        @"东夏园@",
        @"潞城@",
        @"北京西站@",
        @"湾子@",
        @"达官营@",
        @"广安门内@",
        @"菜市口@A出口,品鸭上苑;C出口,渤海湾小海鲜;D出口,爆肚冯(菜市口店);D出口,戈拿旺巴西烤肉;D出口,千禧园城一锅;",
        @"虎坊桥@",
        @"珠市口@",
        @"桥湾@",
        @"磁器口@A出口,北京两广中医医院;A出口,江南龙港酒楼;A出口,天苑阁;A出口,正仁大厦;B出口,普仁医院;B出口,田记串串香重庆火锅;D出口,春福来;D出口,万商汇淘宝城;",
        @"广渠门内@",
        @"广渠门外@",
        @"九龙山@",
        @"大郊亭@",
        @"百子湾@",
        @"化工@",
        @"南楼梓庄@",
        @"欢乐谷景区@",
        @"双合@",
        @"焦化厂@",
        @"朱辛庄@",
        @"育知路@D出口,城北批发市场;D出口,积水潭医院;",
        @"平西府@",
        @"回龙观东大街@A出口,盛百味;A出口,同仁堂药店;B出口,福成肥牛;B出口,铁木真自助;D出口,北京回龙观医院;D出口,上岛咖啡;",
        @"霍营@A出口,老家肉饼(霍营店);E出口,汉密哈顿;F1出口,新岛咖啡;F出口,北京中西医结合医院;",
        @"育新@A出口,北京石油干部管理学院;A出口,晋大妈茶餐厅;A出口,西三旗百汇;A出口,阳坊胜利涮羊肉;B出口,泰华龙旗广场;D出口,北医三院第二门诊部;D出口,德厚轩;D出口,黄记煌;D出口,燕枫楼;",
        @"西小口@A出口,空竹阁食府;",
        @"永泰庄@A出口,肯德基;A出口,清河医院;C出口,知味轩羊蝎子;D出口,百万顺发碳火烤羊腿;D出口,权金城;D出口,星巴顿烤鱼;",
        @"林萃桥@C出口,999急救中心;C出口,奥林匹克公园网球中心;",
        @"森林公园南门@",
        @"奥林匹克公园@A出口,华润万家购物中心;B出口,天虹百货;B出口,新奥购物中心;B出口,中国科学技术馆;D出口,国家体育场;D出口,利昂法式铁板主题餐;D出口,新奥购物中心;E出口,Bella Vista;E出口,U咖啡;E出口,北辰洲际酒店自助餐厅;E出口,北京北辰洲际酒店啡扬咖啡厅;E出口,国家会议中心宴会厅;E出口,国家体育馆;E出口,国家游泳中心;E出口,意秀意大利餐厅;E出口,粤秀轩中餐厅;",
        @"奥体中心@C出口,奥林匹克体育中心;C出口,五洲酒店;C出口,蒸汽盒子火车主题餐厅;D出口,爱家购物中心;D出口,华安御宫;D出口,唐人街;D出口,西域食府;D出口,中华民族博物院;E出口,亚丁美食湾;",
        @"北土城@A出口,爱家珠宝城;A出口,解放军306医院;A出口,利荣酒店龙脉1号;A出口,芝麻花餐厅;B出口,唐人街;C2出口,北京广济中医医院;C2出口,北京广济中医医院;C2出口,首都医科大学附属北京安贞医院;C2出口,斋香园素食;C出口,安贞医院;D1出口,北京第七建设工程公司职工医院;D1出口,金百万(马甸餐厅);D1出口,老诚一锅;D1出口,泓盛花园大酒楼;",
        @"安华桥@A出口,拉菲米亚;A出口,人定湖公园;C2出口,中国木偶剧院;D1出口,福建大厦中餐厅;D1出口,张生记;D2出口,多摩日本料理;D2出口,歌华开元江南中餐厅;D2出口,金海湾燕翅鲍;D出口,中国木偶剧院;",
        @"鼓楼大街@A1出口,金能源大酒楼;A2出口,湘彬酒店;B出口,北京同康医院;B出口,胡杨咖啡厅;B出口,渔老俵鱼府;B出口,原鼎法式铁板烧;B出口,云麓轩;E出口,北京明都中医院;E出口,东联大厦;F出口,汉华国际饭店;G出口,丽江庭院之柔软时光;",
        @"什刹海@",
        @"南锣鼓巷@A出口,北京中医医院;A出口,北京中医医院;A出口,龙海鑫洗浴自助餐;A出口,中央戏剧学院实验剧场;A出口,逅泰厨;A出口,鲿鳗屋;B出口,Cambulac红酒坊;B出口,北海医院;B出口,北京中医院;B出口,都江源;B出口,涵珍园国际酒店餐厅;B出口,十八茶膳;B出口,束河人家;",
        @"郭公庄@A出口,京惠丰;",
        @"丰台科技园@",
        @"科怡路@A出口,芦月轩科丰店;A出口,重庆菜馆;D出口,花乡医院;D出口,汽车博物馆;",
        @"丰台南路@A1出口,丰北医院;A1出口,老城一锅羊蝎子;A2出口,丰台妇幼保健院;A2出口,丰台医院;A2出口,汉中汉;A2出口,渔民烤鱼;",
        @"丰台东大街@",
        @"七里庄@A1出口,方圆涮肉;A1出口,锅神涮涮锅;A1出口,九门涮肉坊;A1出口,亿客隆万丰购物中心;A1出口,渔民码头海鲜火锅;A1出口,正杨门饭庄;A2出口,丰台体育中心;A2出口,渔来旺;C出口,德邻福;",
        @"六里桥@A出口,亿客隆万丰购物中心;B1出口,东兴楼;B1出口,万丰公园;B1出口,西贝西北菜;E出口,西国贸商城;E出口,亿潼隆丰益购物中心;F出口,坤湘府;",
        @"六里桥东@",
        @"北京西站@",
        @"军事博物馆@A出口,军事博物馆;A出口,梅地亚中心牡丹厅;A出口,尚品日餐厅;A出口,小肥羊;A出口,裏頭餐厅;A出口,中国人民革命军事博物馆;A出口,中华世纪坛;A出口,中华世纪坛世界艺术馆;C出口,麦当劳;D出口,锦官居;D出口,亮堂品菜;",
        @"白堆子@B出口,鸭鸭梨;D出口,北京海军总医院;D出口,惠丰堂饭庄;",
        @"白石桥南@A出口,家中宝;A出口,香草香草云南原生态火锅;B出口,大宅门;B出口,老诚一锅;C出口,鼎鼎香;G出口,大鸭梨;G出口,芙蓉湾酒楼;",
        @"国家图书馆@A出口,国家图书馆嘉言堂音乐厅;A出口,锦府盐帮酒楼;B出口,北京石刻艺术博物馆;B出口,富锦天酒楼;B出口,蜀乡竹林;B出口,湘彬食府;B出口,燕兰楼;C出口,首都体育馆;D出口,紫晶宴府;",
        @"巴沟@A出口,麦当劳;C2出口,北京华联万柳购物中心;C2出口,必胜客;C2出口,滇草香云南火锅;C2出口,海底捞;C2出口,眉州东坡酒楼;C2出口,时时乐;C2出口,新辣道鱼火锅;C3出口,黑松白鹿;C3出口,天意坊烤鸭店;C3出口,万柳公园;",
        @"苏州街@A出口,58号花园;A出口,艾丽华酒店;A出口,白家大院;A出口,海淀体育中心;A出口,内联升鞋垫;A出口,权品公馆;A出口,汤城小厨;A出口,五代羊倌;A出口,中国民族博物馆;B出口,鸭王烤鸭店;C2出口,Donny's Club;D出口,海淀妇幼保健院;D出口,香草香草云南火锅;",
        @"海淀黄庄@A1出口,海淀医院;A2出口,汉拿山;A出口,海淀剧院;A出口,权金城;B出口,北京市海淀区博物馆;B出口,必胜客欢乐餐厅;B出口,海淀剧场;C1出口,北京市海淀区博物馆;C1出口,吉野家;C1出口,暖山咖啡;D出口,比格比萨;D出口,九头鹰酒家;D出口,麦当劳;",
        @"知春里@A出口,古晋食府;B出口,百万庄园;B出口,潮富宫食府;B出口,鹤临轩中餐厅;B出口,花蝶日料铁板烧;B出口,沃尔玛;D出口,戈拿旺巴西烤肉;D出口,椰林星诺咖啡;G出口,五道口市场;",
        @"知春路@B出口,湘府明珠贵宾楼;D出口,红轩中餐厅;D出口,雅谷西餐厅;F2出口,北京家恩德运医院;F2出口,沸腾鱼乡;F2出口,口福居火锅;F2出口,丽亭华苑酒店海鲜自助;F2出口,神户日本餐厅;F2出口,小肥羊;",
        @"西土城@A出口,柏彦大厦;A出口,北京东方红酒楼;A出口,世宁大厦;A出口,首亨大厦;A出口,天唯阁中餐厅;B出口,北医六院;B出口,北医三院;B出口,北医三院;B出口,长城电脑大厦;B出口,中国电信博物馆;C出口,吉吉熊比萨宅急送;D出口,红十字医院;D出口,锦秋国际大厦;D出口,渝淮居;D出口,知春轩;",
        @"牡丹园@A出口,北三医院;A出口,翠微百货;A出口,翠微百货;A出口,迪蒙大厦;A出口,福宾乌苏里江野生江鱼食府;A出口,海底捞;A出口,江边城外巫山烤全鱼;A出口,辣尚瘾;A出口,同观商业中心;A出口,湘彬萱湘菜馆;B出口,国安剧场;B出口,铁锅一居;B出口,维廉姆西餐厅;B出口,伊尹海参馆;C出口,北京汇仁中医医院;C出口,德恒会馆;C出口,汇仁中医院;D出口,美廉美超市;D出口,听蝉轩花园美食吧;",
        @"健德门@A出口,306医院;A出口,北京京华友好医院;A出口,三千里烤肉;A出口,味妙烤鱼吧;A出口,西江美食舫;A出口,源昌盛红焖羊肉火锅;C出口,脉客咖啡;D出口,麦当劳;D出口,锡盟炭烤羊腿;D出口,御府新景;",
        @"北土城@A出口,爱家珠宝城;A出口,解放军306医院;A出口,利荣酒店龙脉1号;A出口,芝麻花餐厅;B出口,唐人街;C2出口,北京广济中医医院;C2出口,北京广济中医医院;C2出口,首都医科大学附属北京安贞医院;C2出口,斋香园素食;C出口,安贞医院;D1出口,北京第七建设工程公司职工医院;D1出口,金百万(马甸餐厅);D1出口,老诚一锅;D1出口,泓盛花园大酒楼;",
        @"安贞门@C出口,北中医三院;C出口,河湖餐厅;C出口,乾元串坊;C出口,荣福楼烤鸭店;C出口,三村串坊;C出口,上雅宴;C出口,湘上香食府;C出口,中医药大学第三附属医院;C出口,紫菩提&#8226;饭与茶;D出口,安贞医院;",
        @"惠新西街南口@A出口,北京藏医院;B出口,北平楼(惠新里店);B出口,惠新里小学;B出口,首尔城;B出口,通联大厦;C出口,大亨酒家;C出口,大同江会馆;C出口,海福羊火锅;C出口,辣婆婆;C出口,老诚一锅(中日店);C出口,皖南水乡;C出口,中日友好医院;C出口,中日友好医院;",
        @"芍药居@A出口,Munch New York;A出口,Waiter Brother;A出口,流年咖啡馆;A出口,群生世家餐饮;A出口,太阳宫公园;A出口,伊锦园;",
        @"太阳宫@A出口,凯德MALL;B出口,院落;C出口,干杯大罐烧肉;C出口,凯德MALL;C出口,苗乡楼;C出口,新辣道;C出口,悦府餐饮;C出口,呷哺呷哺;D出口,海底捞火锅;D出口,太阳宫医院;D出口,渝乡人家;",
        @"三元桥@A出口,凤凰汇购物中心;B出口,PANKOO釜山料理;B出口,大渔铁板烧;B出口,凤凰汇购物中心;B出口,浮士德法式西餐厅;B出口,绿茶餐厅;B出口,亭苑餐厅;B出口,云南云海肴;D出口,爱蒂宝;D出口,北京市复康眼科医院;D出口,福之家日本料理店;",
        @"亮马桥@A出口,朝阳区新源里医院;A出口,都汇天地购物中心;A出口,观复博物馆;A出口,上海小南国;A出口,威斯汀扒房;A出口,中国元素;A出口,羲和雅苑烤鸭坊;B出口,北京国际医疗中心;B出口,东方路一号美餐厅;B出口,世纪剧场;C出口,二十一世纪游泳馆;C出口,普拉那啤酒坊;C出口,萨拉伯尔餐厅;C出口,燕莎友谊商城;D出口,玉台上海风味餐厅;",
        @"农业展览馆@A出口,长江1号河鲜酒楼;A出口,廿一层;D1出口,阿森鲍鱼;D1出口,国品餐饮商务会所;D1出口,农业展览馆;",
        @"团结湖@A出口,Turkish mum;A出口,北京武警总队医院;A出口,一千一夜餐厅;A出口,伊朗入迷餐厅;B出口,北京朝阳公园;B出口,富丽客巴西烤肉;B出口,祥记;C出口,北京妇产医院;C出口,北京棕榈泉生活广场;D出口,北京长虹医院;D出口,北京弘医堂中医医院;D出口,北京华盛癫痫病专科医院;D出口,天都里印度餐厅;D出口,一珍香珍膳餐厅;D出口,正院大宅门;",
        @"呼家楼@A出口,藏三昧;A出口,大可食尚铁板烧;A出口,廿九阁;B出口,北京济华医院;B出口,福裕红铁板烧自助餐厅;B出口,三四郎日本料理;B出口,雍雅河鲜酒楼;B出口,圆苑(团结湖店);C2出口,朝阳剧场;C出口,安联大厦;C出口,朝阳剧场;C出口,雨霖大厦;D出口,SOHO&#8226;尚都;D出口,人民日报社医院;D出口,西单商场;E出口,Ishikawa;E出口,朝阳医院;E出口,嘉铭中心;E出口,团结湖大厦;G出口,环球金融中心;G出口,京广中心;G出口,渣打大厦;",
        @"金台夕照@A出口,财富购物中心;A出口,财富中心;A出口,港农冰室;A出口,建外SOHO;A出口,金鼎轩;A出口,久喜回转寿司;A出口,朗悦府;A出口,世贸天阶;A出口,世贸天阶;A出口,旺顺阁鱼头泡饼;A出口,瑶池中餐厅;B出口,京广中心光华医院;B出口,中国第一商城;C出口,民航医院;C出口,中富泰达时代中心;D出口,财富中心;D出口,富尔大厦;D出口,汉威大厦;D出口,和合谷;D出口,数码大厦;D出口,铜牛大厦;D出口,旺座中心;D出口,中国大饭店远洋光华;D出口,肿瘤医院;",
        @"国贸@A出口,财富中心;A出口,建外SOHO;A出口,建外SOHO;A出口,俏江南(国贸店);A出口,秀水;A出口,中海广场;A出口,中海广场;A出口,羲和雅苑烤鸭坊;B出口,麦当劳;B出口,万达广场;C出口,北京银泰中心;C出口,财富购物中心;C出口,光华路SOHO;C出口,金地广场;C出口,穗高日本料理;D出口,豪上豪牛排馆;E2出口,世贸天阶;F出口, 小肥羊;F出口,慈铭体检中心;F出口,麦乐迪;G出口, 天禧火锅(国贸店);G出口,万达广场;G出口,渝乡人家(国贸店);",
        @"双井@A出口,UME影城;A出口,百安居家乐福;A出口,宝岛眼镜;A出口,北京富力广场;A出口,必胜客;A出口,迪信通;A出口,富力城;A出口,国美电器;A出口,哈根达斯;A出口,哈根达斯;A出口,康师傅牛肉面;A出口,肯德基;A出口,乐友;A出口,麦当劳;A出口,满记甜品;A出口,瑞齿口腔;A出口,世纪联华;A出口,呷哺呷哺;B1出口,皇城老妈;B1出口,零度空间;B1出口,米斯特比萨;B出口,乐成购物中心;C出口,四川仁火锅;D出口,比格;D出口,朝日口腔;D出口,垂杨柳医院;D出口,大中;D出口,豪尚豪牛排馆;D出口,交通银行;D出口,千子莲;D出口,全聚德;D出口,全聚德双井店;D出口,四川仁火锅;D出口,田老师红烧肉;D出口,同乐江南;D出口,味多美;D出口,仙踪林;D出口,优莉雅欧亚餐厅;",
        @"劲松@A出口,嘉事堂药店;A出口,肿瘤医院;B出口,巴西烤肉;B出口,北京圣保罗医院;B出口,必胜客宅急送;B出口,朝阳区劲松医院;B出口,滇草香云南原生态火锅;B出口,富丽客巴西烤肉;C出口,北京广仁医院;C出口,广仁医院;C出口,海文大厦;C出口,汉斯特烤肉;C出口,华泰饭店;C出口,劲松大厦;C出口,蜀国演义酒楼;C出口,天客隆;C出口,中复电讯;D出口,北京华大中医医院;D出口,北京市垂杨柳医院;D出口,羔羊涮肉;D出口,吉品日式料理;D出口,泰村鱼翅酒楼;D出口,眼镜城;",
        @"潘家园@A出口,古玩城;A出口,汉拿山潘家园店;A出口,旧货市场;A出口,绿桂坊精品购物中心;A出口,全鑫园烤鸭店;A出口,蝎王府羊蝎子;A出口,眼镜城;A出口,征程温州海鲜酒楼;A出口,中海中医院;C2出口,国窖汇;C2出口,汉华购物中心;C2出口,妙厨365;C2出口,五福龙大酒楼;",
        @"十里河@A出口,川渝川菜馆;A出口,海龙中餐厅;A出口,宏状元;A出口,居然之家;A出口,生态鱼火锅;A出口,双渔座养生火锅;A出口,一盛料理;B出口,吉野家;",
        @"分钟寺@A出口,蜀1蜀2家常菜;A出口,巫山烤全鱼;C出口,四川会馆餐厅;C出口,新川办餐厅;C出口,新川办金沙餐厅;",
        @"成寿寺@A出口,朝龙五金市场;C2出口,鸿禧大清花;C2出口,妈妈宴;C2出口,田源鸡火锅;",
        @"宋家庄@C出口,嘉和一品;D出口,九天食府;D出口,扑满山大厦;D出口,尚贤居餐厅;D出口,石榴庄社区卫生服务站;D出口,呷哺呷哺;",
        @"石榴庄@A出口,京深海鲜市场;C出口,北京网球中心;C出口,大鸭梨;C出口,光彩体育馆;C出口,辣道江边梭边鱼火锅;C出口,松阁天韩式烤肉;C出口,炭烧鸽坊;C出口,萃湘林酒楼(石榴园店);",
        @"大红门@A2出口,福海公园;A2出口,满味轩火锅店;A出口,服装商贸城;C2出口,骨康源中医馆;",
        @"角门东@A出口,乐天玛特;A出口,银泰百货;",
        @"角门西@A出口,棒约翰;A出口,金百万;A出口,金汉斯;A出口,土大力;E出口,北京红旗精神病医院;E出口,必胜客欢乐餐厅;E出口,拾味馆;E出口,天外天烤鸭店;",
        @"草桥@B出口,Cookie World;B出口,北京同康医院;B出口,贵人斋涮肉坊;B出口,好巴食;B出口,嘉河公园;B出口,上鱼舫草桥店;E出口,北京明都中医院;E出口,好巴食巫山烤全鱼;",
        @"纪家庙@A出口,东方夏威夷商务会馆;A出口,广济医院;A出口,纪家庙卫生服务站;",
        @"首经贸@B出口,北京海华医院;B出口,乐购超市;B出口,天兰尾货;B出口,小小餐厅;C出口,大鸭梨(花乡店);D出口,猫眼餐厅(首经贸店);",
        @"丰台站@",
        @"泥洼@A2出口,亿潼隆丰益购物中心;A2出口,渔夫烤鱼;C1出口,北京华康中医医院;C1出口,北京庄怡公园;C1出口,福寿江鱼酒楼;C1出口,铁锅炖江鱼(;C2出口,金百万(丰管店);C2出口,金百万烤鸭店;C2出口,肯德基;C2出口,西国贸大酒店餐厅;C2出口,湘锦轩食府;C出口,丰益肛肠医院;C出口,华康中医院;",
        @"西局@",
        @"六里桥@A出口,亿客隆万丰购物中心;B1出口,东兴楼;B1出口,万丰公园;B1出口,西贝西北菜;E出口,西国贸商城;E出口,亿潼隆丰益购物中心;F出口,坤湘府;",
        @"莲花桥@A出口,广安门外城市休闲森林公园;A出口,信苑饭店信苑韩食坊;A出口,颐和轩风味餐厅;B出口,京都信苑饭店;B出口,乡榭丽寨咖啡苑;C出口,北京国济中医医院;C出口,北京国济中医医院;D出口,华联商厦;",
        @"公主坟@A1出口,城乡贸易中心;A1出口,翠微广场;A1出口,东来顺饭庄;A1出口,俏江南;A1出口,鲜境豆捞;A出口,百万庄园;A出口,城乡华懋商场;A出口,国美电器;B2出口,必胜客欢乐餐厅;B2出口,水利医院;B出口,凯德MALL;B出口,四川仁火锅;D出口,龙泽手机市场;D出口,苏宁电器;G出口,城乡贸易中心;",
        @"西钓鱼台@A出口,304医院;A出口,北平楼;A出口,鸿运天外天烤鸭店;A出口,华光商厦;A出口,肯德基航天桥餐厅;A出口,空军总医院;A出口,四季曙光公园;A出口,玉都饭店;A出口,裕龙酒店;A出口,肿瘤医院;B出口,北京国瑞中医医院;B出口,莱塔汇;B出口,中国人民解放军空军总医院;",
        @"慈寿寺@C出口,华普超市;H出口,点点心食坊;",
        @"车道沟@B出口,北京大学第三医院住院部分部;B出口,兵器工业北京北方医院;C出口,江田日本料理;D出口,广德坊;D出口,凰予轩酒家;D出口,阳光威海海鲜;",
        @"长春桥@A出口,巴贝拉意式休闲餐厅;A出口,沸腾渝家(金源店);A出口,汉拿山韩式烤肉;A出口,金馆西餐厅;A出口,九头鸟酒家;A出口,辣婆婆;A出口,乐蛙蛙(远大路店);A出口,苗乡楼(金源店);A出口,燕莎友谊商城;",
        @"火器营@",
        @"西直门@A出口,PANKOO釜山料理;A出口,东来顺;A出口,福成肥牛西城店;A出口,华堂商场(西外店);A出口,西堤牛排;B出口,世纪谭府酒楼;D出口,北大人民医院;D出口,东方沪园大酒楼;D出口,锅色天香;D出口,凯德MALL(西直门店);D出口,展览路医院;",
        @"大钟寺@A出口,大钟寺古钟博物馆;A出口,航空航天医院;A出口,中坤广场;B出口,北京真品旺火锅;B出口,海底捞火锅;B出口,金源福城肥牛;B出口,王府井百货;B出口,味千拉面;B出口,喜派吉烤肉自助餐厅;B出口,友仁居时尚精品火锅;",
        @"知春路@B出口,湘府明珠贵宾楼;D出口,红轩中餐厅;D出口,雅谷西餐厅;F2出口,北京家恩德运医院;F2出口,沸腾鱼乡;F2出口,口福居火锅;F2出口,丽亭华苑酒店海鲜自助;F2出口,神户日本餐厅;F2出口,小肥羊;",
        @"五道口@A出口,北京醉爱时尚餐厅;A出口,金五星购物广场;A出口,圣熙8号购物中心;A出口,一心日本料理;B出口,东来顺;B出口,华联商厦;B出口,老车记麻辣香锅;B出口,日昌餐馆;B出口,世纪谭府酒楼;B出口,五道口购物中心;B出口,一志寿司铁板烧;B出口,祖母的厨房;",
        @"上地@A出口,BHG Mall;A出口,麦当劳;A出口,香丰阁酒楼;",
        @"西二旗@A1出口,麦当劳;A1出口,食尚五家尧;A1出口,愉味麻辣香锅;B出口,辉煌一代海鲜酒楼;B出口,龙泉居羊蝎子;",
        @"龙泽@",
        @"回龙观@A出口,BHG Mall;A出口,北京回龙观医院;A出口,川聚缘巫山烤鱼;A出口,和风细雨悦食汇;A出口,田园鸡火锅;A出口,新辣道鱼火锅;A出口,阳坊大都涮羊肉;",
        @"霍营@A出口,老家肉饼(霍营店);E出口,汉密哈顿;F1出口,新岛咖啡;F出口,北京中西医结合医院;",
        @"立水桥@A出口,北京万和颈椎病医院;A出口,川禾轩烤鱼坊;A出口,川珍珍火锅;A出口,京福华肥牛;A出口,顺满堂;A出口,万意商城;B1出口,锦绣年华酒楼;B1出口,龙德广场;",
        @"北苑@A出口,吉野家;A出口,四合苑食府;A出口,正一味北苑华贸餐厅;",
        @"望京西@C出口,得一福云南铜瓢火锅;C出口,恒峰鱼酷;C出口,江南美主题餐厅;C出口,美顺园酒楼;C出口,铁锅炖江鱼;C出口,望承公园;C出口,湘怡人餐厅;C出口,玉流宫;C出口,珍菇源健康营养火锅;D出口,北京市老年活动中心;",
        @"芍药居@A出口,Munch New York;A出口,Waiter Brother;A出口,流年咖啡馆;A出口,群生世家餐饮;A出口,太阳宫公园;A出口,伊锦园;",
        @"光熙门@A出口,老诚一锅;A出口,太阳宫医院;B出口,阿诚潮粤大排档;B出口,老北京铜锅涮肉;B出口,蟹老宋;B出口,新辣道梭边鱼火锅;B出口,愚掌门鱼火锅;B出口,渝洲家厨;",
        @"柳芳@A出口,北京玛丽妇婴医院;A出口,东来顺;A出口,烽上席;A出口,华海白癜风医院;A出口,胶东海鲜;A出口,金泰福龙酒楼;A出口,煤炭总医院;A出口,蝎王府;A出口,渔公渔婆;",
        @"东直门@A出口,彼得堡西餐厅;A出口,福惠龙;A出口,花家怡园(簋街店);A出口,老井俄式餐厅;A出口,中国中医科学院针灸医院;B出口,北京济仁中医骨病医院;B出口,广宁中医院;B出口,自来水博物馆;C出口,东环广场;C出口,蜂巢剧场;C出口,国盛商场;C出口,银座百货;D出口,北京市东城区东外医院;D出口,北京中医药大学东直门医院;D出口,豆捞坊(东直门店);D出口,九头鹰酒家;D出口,来福士购物中心;D出口,中国医史博物馆;D出口,中国中医研究院骨伤科医院;",
        @"张郭庄@B出口,蒙食部落;",
        @"园博园@",
        @"大瓦窑@",
        @"郭庄子@D出口,天贵食府;D出口,呷哺呷哺;",
        @"大井@A出口,百万轩;A出口,东方圣斯自助餐厅;B出口,百万庄园;B出口,郭林食府;B出口,蜀山宏府;B出口,湘鄂情;B出口,呷哺呷哺;",
        @"七里庄@A1出口,方圆涮肉;A1出口,锅神涮涮锅;A1出口,九门涮肉坊;A1出口,亿客隆万丰购物中心;A1出口,渔民码头海鲜火锅;A1出口,正杨门饭庄;A2出口,丰台体育中心;A2出口,渔来旺;C出口,德邻福;",
        @"西局@",
        @"俸伯@C2出口,峨嵋酒家;C2出口,宏利兴盛饭庄;",
        @"顺义@A出口,北京大红人酒家;A出口,国泰百货;A出口,金百万烤鸭店;A出口,金汉斯;A出口,金兆福海鲜大酒楼;A出口,肯德基;A出口,隆华购物中心;A出口,权金城韩国烧烤;A出口,顺义区中医院;A出口,顺义区肿瘤医院;A出口,顺义水上公园;A出口,万方豆捞;A出口,新世界百货;A出口,中国医科大学顺义医院;F出口,呷哺呷哺;",
        @"石门@A出口,福成肥牛国泰店;A出口,红菜坊;A出口,权金城韩国烧烤;B出口,北京大红人酒家;B出口,北京京顺医院;B出口,呷哺呷哺;C出口,风光老灶麻辣香锅;C出口,国泰百货(顺义店);C出口,隆华购物中心;C出口,新世界百货;",
        @"南法信@B出口,福口居;B出口,南法信医院;",
        @"后沙峪@B出口,福和小馆;C出口,清真鸿栖饭庄;",
        @"花梨坎@",
        @"国展@A出口,赛百味;A出口,中国国际展览中心;B出口,老城一锅;B出口,蜀鑫酒楼;C出口,鸿运天祥烤鸭店;",
        @"孙河@A出口,ART 300画廊主题餐厅;D出口,财富公馆会所;D出口,孙河医院;D出口,阳坊大都涮羊肉;",
        @"马泉营@A出口,BURGERS&BEER;A出口,大红袍麻辣香锅;A出口,金百万烤鸭店;A出口,赛特奥莱餐厅;",
        @"崔各庄@",
        @"望京@A出口,华堂商场;A出口,玛露脊骨土豆汤;A出口,望京华彩商业中心;A出口,望京悠乐汇;A出口,中国电影博物馆;B出口,凯德MALL;C出口,海底捞;C出口,脊骨土豆汤101号店;C出口,金汉斯;C出口,偶巴尔坛;C出口,闻记老邻居;C出口,湘西土菜;C出口,小肥羊;C出口,新世界百货;C出口,中国中医科学院望京医院;",
        @"望京西@C出口,得一福云南铜瓢火锅;C出口,恒峰鱼酷;C出口,江南美主题餐厅;C出口,美顺园酒楼;C出口,铁锅炖江鱼;C出口,望承公园;C出口,湘怡人餐厅;C出口,玉流宫;C出口,珍菇源健康营养火锅;D出口,北京市老年活动中心;",
        @"关庄@",
        @"安立路@",
        @"奥林匹克公园@A出口,华润万家购物中心;B出口,天虹百货;B出口,新奥购物中心;B出口,中国科学技术馆;D出口,国家体育场;D出口,利昂法式铁板主题餐;D出口,新奥购物中心;E出口,Bella Vista;E出口,U咖啡;E出口,北辰洲际酒店自助餐厅;E出口,北京北辰洲际酒店啡扬咖啡厅;E出口,国家会议中心宴会厅;E出口,国家体育馆;E出口,国家游泳中心;E出口,意秀意大利餐厅;E出口,粤秀轩中餐厅;",
        @"北沙滩@",
        @"六道口@",
        @"清华东路西口@",
        @"四惠@A出口,海龙鲜（百子湾店）;A出口,麦当劳;C1出口,四惠商城;C1出口,栀子花开茶餐厅;D出口, 小渔港(四惠店);E出口, 味百年港式餐厅;E出口,枫铃日本料理;",
        @"四惠东@A出口,四惠商场;A出口,中国紫檀博物馆;B出口,尚8里文创园;",
        @"高碑店@A出口,紫檀博物馆;E出口,傣家村大酒店;E出口,高碑店水库;E出口,江宴府;",
        @"传媒大学@A出口,多纳达;A出口,牛牛茶餐厅;A出口,主题空间新意大利餐厅;",
        @"双桥@D出口,北海明珠海鲜宫;D出口,丁丁洋回转自助火锅;D出口,国泰百货;D出口,肯德基;D出口,辣悠美麻辣香锅;D出口,权金城;D出口,萨莉亚意式餐厅;D出口,正一味;D出口,呷哺呷哺;",
        @"管庄@A出口,朝北涮肉;A出口,德口福重庆鸳鸯火锅;A出口,吉野家;A出口,麦当劳;A出口,一品渝香干锅鸭头;A出口,中百世贸;A出口,呷哺呷哺;D出口,好伦哥;",
        @"八里桥@",
        @"通州北苑@A出口,BHG Mall;B出口,国泰百货;B出口,新辣道;B出口,新石器（天时名苑店）;C出口,呷哺呷哺;",
        @"果园@A出口,李老商品市场;B出口,潞河医院;B出口,青年餐厅;B出口,润海福韩国料理;B出口,三千里烤肉;B出口,听涛雅苑食府;",
        @"九棵树@A出口,风颐楼湘菜王;A出口,家乐福;A出口,老诚一锅;A出口,阳光新生活广场;B出口,爱锅;B出口,丁丁洋回转自助火锅;B出口,汉拿山通州店;B出口,味千拉面;B出口,争鲜回转寿司;E出口,6号食府;",
        @"梨园@A出口,蓝岛大厦(通州店);B出口,东来顺;B出口,豆花鱼庄;B出口,江湖鱼翻天;B出口,荆竹园港式餐厅;B出口,麻辣攻略;B出口,呷哺呷哺;C出口,福成肥牛梨园店;C出口,锦馨阁梭边鱼;",
        @"临河里@A出口,金紫银平价海鲜城;A出口,晋风庄园;A出口,梨园主题公园;A出口,万龙洲海鲜;A出口,香鼎盛火锅城;B出口,韩美林艺术馆;B出口,倪氏海鲜大酒店;",
        @"土桥@A出口,自在仁;",
        @"南邵@A出口,昌平妇幼保健院;A出口,昌平区医院;A出口,昌平中医院;A出口,和庆斋;B出口,明十三陵博物馆;",
        @"沙河高教园@",
        @"沙河@B2出口,京门老爆三;B2出口,久玖鳄鱼湖公园;B2出口,湘都府私房菜;B2出口,阳坊胜利涮羊肉;",
        @"巩华城@",
        @"朱辛庄@",
        @"生命科学园@A出口,汉拿山;A出口,乐食派麻辣香锅;A出口,拿渡麻辣香锅;A出口,五榖日本料理;A出口,香港浪漫座;A出口,永昌铁板烧;",
        @"西二旗@A1出口,麦当劳;A1出口,食尚五家尧;A1出口,愉味麻辣香锅;B出口,辉煌一代海鲜酒楼;B出口,龙泉居羊蝎子;",
        @"宋家庄@C出口,嘉和一品;D出口,九天食府;D出口,扑满山大厦;D出口,尚贤居餐厅;D出口,石榴庄社区卫生服务站;D出口,呷哺呷哺;",
        @"肖村@A出口,比邻乡村;A出口,城外城家装建材国际交易中心;A出口,慈康医院;B出口,北京金桥医院;B出口,城外城家居广场;D出口,北京康兴医院;D出口,东方丽人医院;D出口,肯德基;",
        @"小红门@A出口,筋头巴脑老鸭汤;B出口,小红门社区卫生服务中心;B出口,小红门医院;",
        @"旧宫@A2出口,百度烤肉专门店;A2出口,海龙鲜麻辣香锅;A2出口,小湘旺;B1出口,旧宫医院;B1出口,物美超市;B1出口,育龙和谐医院;B2出口,旧宫医院;",
        @"亦庄桥@A1出口,富源里小区;A1出口,亦庄医院;A2出口,北京味彩烤肉;A2出口,吉野家;A2出口,龙田山庄;A2出口,麦咖茶餐厅;A2出口,一屋一食主题餐厅;A2出口,亦庄医院;A2出口,缘丰涮肉;A2出口,震东方饭店;A出口,亦庄体育中心;B1出口,星岛假日;",
        @"亦庄文化园@A2出口,捌零西餐;A2出口,福乐捞吧;A2出口,黄记煌;A2出口,首尔村;A2出口,速喜日本料理;A2出口,亦捞坊;A出口,国家康复医院;B1出口,亦庄创意生活广场;",
        @"万源街@A1出口,力宝广场;B1出口,亦海人家宏达;B2出口,苏园;D出口,浩海海鲜美食城;D出口,锦府盐帮酒楼;D出口,米斯特比萨;D出口,朴家の饭;D出口,田源鸡火锅;D出口,湄公米季越南菜餐厅;",
        @"荣京东街@B1出口,吉野家;",
        @"荣昌东街@A1出口,北京兴基铂尔曼饭店;A1出口,车湘园酒楼;A1出口,意浓世界餐厅;A1出口,樱町三味日本料理;B1出口,亦庄崒明轩餐厅;B2出口,赛百味;",
        @"同济南路@A1出口,八九不离十川味美食;A1出口,滇馨园;A1出口,亦海人家永康店;A1出口,呷哺呷哺;A1出口,鑫隆四季涮肉;B出口,同仁医院南区;",
        @"经海路@",
        @"次渠南@A出口,通州第三医院;C出口,百分百购物;",
        @"次渠@D出口,通州区第三医院;",
        @"郭公庄@A出口,京惠丰;",
        @"大葆台@D出口,大葆台西汉墓博物馆;D出口,大葆台西汉墓博物馆;",
        @"稻田@",
        @"长阳@A出口,林记坊;A出口,麦瑞克;A出口,仙踪林;A出口,星巴克;A出口,呷哺呷哺;B出口,华冠天地;",
        @"篱笆房@A1出口,拿渡麻辣香锅;A2出口,岸枫庭港式休闲茶餐厅;B1出口,麦当劳;",
        @"广阳城@",
        @"良乡大学城北@",
        @"良乡大学城@A2出口,坤满御香酒家;A2出口,香不辣;B2出口,GAS Coffee;B2出口,大厨汤烤;",
        @"良乡大学城西@A1出口,北京中研中医院;B出口,汉釜城烤肉店;",
        @"良乡南关@A1出口,老城一锅;A1出口,老诚一锅;A1出口,小肥羊;A1出口,洋森餐厅;A2出口,国泰百货;A2出口,好味源干锅鸭头;",
        @"苏庄@A2出口,北京市房山区康复医院;B出口,房山区老年病医院;",
        @"东直门@A出口,彼得堡西餐厅;A出口,福惠龙;A出口,花家怡园(簋街店);A出口,老井俄式餐厅;A出口,中国中医科学院针灸医院;B出口,北京济仁中医骨病医院;B出口,广宁中医院;B出口,自来水博物馆;C出口,东环广场;C出口,蜂巢剧场;C出口,国盛商场;C出口,银座百货;D出口,北京市东城区东外医院;D出口,北京中医药大学东直门医院;D出口,豆捞坊(东直门店);D出口,九头鹰酒家;D出口,来福士购物中心;D出口,中国医史博物馆;D出口,中国中医研究院骨伤科医院;",
        @"三元桥@A出口,凤凰汇购物中心;B出口,PANKOO釜山料理;B出口,大渔铁板烧;B出口,凤凰汇购物中心;B出口,浮士德法式西餐厅;B出口,绿茶餐厅;B出口,亭苑餐厅;B出口,云南云海肴;D出口,爱蒂宝;D出口,北京市复康眼科医院;D出口,福之家日本料理店;",
        @"3号航站楼@",
        @"2号航站楼@",
        @"公益西桥@A出口,安太医院;A出口,五谷老妈;B出口,昂歌乐玛特色文化演绎饭店;B出口,黄记煌三汁焖锅;B出口,回味九格;B出口,陕亿边;B出口,蜀风阁巫山碳烤全鱼;B出口,鱼打头;B出口,渝乡情;C出口,华冠天地;D出口,BHG Mall;D出口,华联商厦;",
        @"新宫@A出口,大年杀猪菜;A出口,海子公园;",
        @"西红门@A出口,北京地铁文化公园;A出口,小桥人家酒楼;B1出口,乐家购物中心;B1出口,麦当劳;B1出口,泡泡火锅;B1出口,三胖子铜锅涮肉;B1出口,傻一锅;B2出口,吉野家;B2出口,粥面故事;",
        @"高米店北@B2出口,清真火锅涮肉;D出口,谷香缘;D出口,晋贤居饭庄;D出口,京好味烤鸭楼;D出口,蜀都嘎嘎鸭头;D出口,香园烤鸭店;",
        @"高米店南@B1出口,眉州东坡小吃;B1出口,呷哺呷哺;B2出口,避风港;B2出口,权金城;B2出口,正一味;C出口,枸玛西餐厅;D出口,仁人居;D出口,蜀都嘎嘎鸭头;",
        @"枣园@A出口,呷哺呷哺;B出口,黄记煌;B出口,吉野家;B出口,康庄公园;C出口,渝老巴川味火锅;C出口,枣林公园;",
        @"清源路@A出口,比格比萨;B出口,大兴区中医医院;B出口,小豆花村;B出口,兴旺公园;B出口,中国中医科学院广安门医院南区;C出口,京福华肥牛;C出口,仁和医院;",
        @"黄村西大街@A出口,藏素风格餐厅;A出口,红红海鲜坊;A出口,聚源楼;A出口,乐得捞豆捞火锅;A出口,首都医科大学大兴医院;B出口,大兴区妇幼保健院;C出口,大兴妇幼保健院;C出口,大兴区医院;C出口,首都医科大学大兴医院;",
        @"黄村火车站@",
        @"义和庄@A出口,念坛公园;",
        @"生物医药基地@",
        @"天宫院@"
        
    };
    NSString* busdata[] = {
        @"苹果园@A口,931 981 892 929 959 664 597 370 961;B口,527 399 972 472;C口,527 399 972 472 ;D口,981 941 370 959 664 597 325 336 396 992 运通112 运通116 长城旅游专线车;",
        @"古城@A口,327 385 318 958;B口,959 597 337 354 941;C口,327 385 959 318;D口,941 597 337 958 354;",
        @"八角游乐园@A口,527 325 337 597 941 545 959 472 663 212夜 598 965 914;B口,325 337 597 941 373 472 527 598 959 663 专46 965 914 354 574 ;",
        @"八宝山@A口,545 546 337 527 941 914;B口,76 373 728 运通120 961 574 46 1;C口,1 69 76 运通120 941 546 373 特10;D口,545 527 ;",
        @"玉泉路@A口,389 337 941 特10 ;B口,76 370 373 436 507 运通120 212夜 850 389;C口,76 373 运通120 212夜 436;D口,941 337 472 473 78 79 452 481 597 736;",
        @"五棵松@A口,952 967 982 983;B口,436 370 212夜 64;C口,212夜 337 436 624 370 运通120 370 运通115 740 97 634 627 特9;D口,64 76 568 624 634 740 运通115 1 97 627;",
        @"万寿路@A口,76 337 373 436 624 64 89 370 运通120 212夜;B口,32 33;C口,68 77 308 335 运通120 451 ;D口,76 89 337 370 373 64 436 212夜 624 451 335 77 68 308;",
        @"公主坟@A口,无;B口,1 52 68 613 74 323 374 968 944 631 698;C口,52 运通103 658 89 323 368 213 373 374 944 968 运通102 300 631;D口,89 323 944 运通102 运通201 74 631 968;",
        @"军事博物馆@A口,21 78 1 68 308 ;B口, 特18 94 99 337;C口,1 21 65 68 78 99 308;D口,337 94;",
        @"木樨地@A口,1 21 65 68 114 308 337 78 695 717 特5 特18;B口,52 728 99 209 ;C口,52 114 308 337;D口,52 114 308 337;",
        @"南礼士路@A口,1 37 19 56 46;B口,15 19 46 56;C口,19 46 49 56;D口,46 56 19 37;",
        @"复兴门@A口,金融街专线1 84 特12 特4 50 44 387 694;B口,1 15 37 52 337 99 205夜 728;C口,1 15 37 52 90 337 99 205夜;D口,395 456 662 691 423 特4 特12 44 49 50 84 661 939;",
        @"西单@C口,1 22 52 90 728 99 ;D口,1 52 90 728 99 205夜 70;E口,15 37 88 205夜;",
        @"天安门西@A口,22;B口,728 22 5 专1 专2 1 99 52 90 205夜;C口,1 52 205夜 37 728;",
        @"天安门东@A口,无;B口,1 2 52 99 120 90 126 82 205夜 210夜 专1 专2;C口,1 2 52 59 82 90 728 120 126 203夜 205夜 210夜 99;D口,1 2 52 59 82 90 728 120 126 203夜 205夜 210夜 99;",
        @"王府井@A口,特11 52 99 103 104 120 126 201夜 205夜 211夜 420 专2 90 127 1;B口,41 52 59 99 120 126 420 203夜 205夜 90 127;C口,无;",
        @"东单@A口,1 52 99 110 106 116 108 111 684 685 204夜;B口,205夜 ;C口,25 205夜 39 204夜 203夜 99;D口,41 684 685 127;",
        @"建国门@A口,1 37 120 403;B口,120 43;C口,122 43;",
        @"永安里@A口,120 609 126 1 205夜 9 666 43 99 729 668 673 28 403;B口,28 120 126 639 43 403 673;C口,99 673 666 668 729 609 1 9 205夜;",
        @"国贸@A口,9 28 729 99 609 938 619 1 58;B口,113 402 405 421 488 503 686 707 729 601 特8 运通107 1 9 28 609 619 57 11 938 98 214夜 502 666 669 938;C口,11 28 57 312 348 402 405 601 647 648 667 669 686 707 805 806 专5 专10 91 214夜 98 113 107 814 998 886;D口,9 28 609 666 668 729 804 805 938 619 58;",
        @"大望路@A口,30 31 595 486 605 677 973 988 502 621 984 985 207支 648 668 57 1 811 405 402 312 666 667 669 728 205 11 647;B口,11 30 595 621 677 715 1 31 57 205夜 312 402 405 486 605 647 648 649 666 667 668 669 728 811 812 938;C口,无;D口,205夜;",
        @"四惠@A口,1 57 312 322 363 397 402 405 455 468 475 496 506 648 657 666 984 989 58 382 450 581 553 865 671 205 207;B口,657 648 205 312 382 666 581 984 865 989 363;C口,无;D口,657 740 特9;",
        @"四惠东@A口,312 382 397 468 475 506 553 581 666 运通121 450;B口,无;",
        @"西直门@A口,87、375、438、563、608、632;B口,7、105、111、608、11  ;C口,7、105、111 ;D口,209、563、632、651、运通106、夜209、360慢、362、534、651快;",
        @"积水潭@A口,27、44、104、347、398、498、345、618、635、881、883、886、888、670、5、914、344、919;B口,27、635、885、83 ;C口,22、38、47、409、626、690、609、826;",
        @"鼓楼大街@A口,27、44外、206、380、409、625、909、特12外、27、44外、206、380、409、625、909、特12外 ;B口,380、409;",
        @"安定门@A口,44、758、108、104、858、18、27、快3、特2、特11、特12 ;B口,119、125、407、快3、龙泉公墓专线、426、108、113、201、328、430、558;",
        @"雍和宫@A口,13、44、特12、858、特2、130、909、18、62、116、684;C口,13 18 44 62 116 130 684 特12 858 特2 909    ;",
        @"东直门@A口,18、44内; 44外; 75、123、130、612、688、966、特12内; 特12外; 特2、夜20内; 夜20外; 夜32、24、106、107、117、612、635、夜10内; 夜10外; 夜6;B口,3、24、106、107、117、123、131、401、404、413、416路环行; 635、688、866、909、915区; 916、966、机场巴士2线夜班线; 机场巴士3线; 夜10内; 夜10外; 夜32、夜6;C口,无;D口,无;",
        @"东四十条@A口,113、115、118;B口,113、115、118;C口,75、113、115、118 ;D口,113、115、118;",
        @"朝阳门@A口,快2、112、110、109、750、619、75、101、420;F口,101、109、112、420;",
        @"建国门@A口,728、1、37、52、120、126、99、90、205、208;B口,1、205、804、120、126、673、99、728、特12、44、90 ;C口,特2、120、126、420、728、99、37、1、122、403、938、639、805、25、44;",
        @"北京站@A口,103、104;B口,特2、9、24、204、673、674、804、729、42、122、403、938、673、805;C口,674、827、829、957、20、203、204、39、209、434、10、29、52、59;D口,103、104、104快、211、208;",
        @"崇文门@A1口,60、8、9、116、110、106、684、685A1口、 44内、59、110、夜209、60、8、夜203 ;A2口,9、41、673、723、729、20、特2、44内、59、110、夜209  ;B1口,25、39、41、684、685、106、108、110、116、111;B2口,9、41、673、723、729、20、特2 ;C口,12环、43、44外、525、610、111、108    D口：110、673、729、723、特2、8、9、60、夜209、20、103、104、夜211;D口,110、673、729、723、特2、8、9、60、夜209、20、103、104、夜211;",
        @"前门@A口,无;B口,快速公交1线;C口,快速公交1线;",
        @"和平门@A1口,无;A2口,7、14、70 ;B1口,67、337、301、673、608、44内、9 特2、特4、特7、夜212、夜209 ;B2口,14;C1口,44外、66、67、301、673、608、特2、特4、特7、夜212、夜209     ;C2口,15、7 ;D1口,无;D2口,15、7;",
        @"宣武门@A1口,9、673、夜209  ;A2口,83、102、105、109、603、604、夜204;B1口,特2、特4、特7、7、15、44内、67、608、夜12;B2口,83、夜204;C1口,特2、特4、15、44外、67、特7、608、夜212 ;C2口,102、105、109、603、70、54、604 ;D1口,9、54、673、夜204   ;D2口,603、604、夜204、54、102、105、109;",
        @"长椿街@A1口,395、661、662、47、特14、67、83、301、901快、44内、夜209、夜213  ;A2口,10、38、88、477    ;B1口,7、10、38、15、88、477;B2口,9、301、337、673、夜212;C1口,10、38、88、477、夜213;C2口,9、特14、67、83、673、夜209、特2、特7、301、337、夜212 ;D1口,44、特4;D2口,无;",
        @"复兴门@A口,61、80、84、10、102、103、121、603、714、612、694、运通106、特12外;B口,13、42、61、101、102、103、121、409、423、490、603、604、623、685、694、714、202夜、特12内、19、121;C口,13、42、101、102、103、409、603、612、623、685、211支、202夜、604 ;D口,13、42、56、61、80、101、102、103、121、603、612、623、697、714、运通106;",
        @"阜成门@A口,61、80、84、10、102、103、121、603、714、612、694、运通106、特12外;B口,13、42、61、101、102、103、121、409、423、490、603、604、623、685、694、714、202夜、特12内、19、121;C口,13、42、101、102、103、409、603、612、623、685、211支、202夜、604 ;D口,13、42、56、61、80、101、102、103、121、603、612、623、697、714、运通106;",
        @"车公庄@A口,特12外、44外、80、604、691、694、693、392、387、21、618、562、夜209、490、运通106 ;C口,运通106、562、632、392、375、50、80、604、693、21、44 84、387、490、618、691、694、特2 ;",
        @"安河桥北@B口,482、512、575;A口,330、346、384、718、运通112;C口,330、346、375、498、534、562、718、特10、运通106、运通112;D口,330、346、375、697、718、特10、运通112;",
        @"北宫门@A口,303、330、331、346、375、384、563、601、608、683、696、697、718、特5、特10;D口,303、330、331、346、375、384、563、601、608、683、696、697、718、特5、特10;C口,无;",
        @"西苑@A口,319、320、375、384、393、432、476、482、509、534、563、636、671、特5、特10;B口,333外、394、438、476、482、563、579、601、608、683、696、697、718、952、968、特5、特6、特10、运通106、运通108、运通114、运通118;C口,319、320、331、332、393、394、432、476、509、601、636、671、683、696、718、夜209;",
        @"圆明园@B口,319、320、331、365、432、438、498、508、562、579、601、614、628、664、681、696、697、982、特4、特6、运通105、运通124、运通205;C口,319、320、331、365、375、432、438、498、508、562、579、601、614、628、656、664、681、683、696、697、699、717、特6、运通105、运通124、运通205;A口,332、333、394、608、718、运通106、运通114、运通118、运通124、夜209;",
        @"北京大学东门@C口,307、320、355、365、498、579、601、614、681、696、697、699、717、731、982、特4、特6、运通105、运通110、运通205;D口,307、320、355、365、498、579、601、614、681、696、697、699、717、731、982、特4、特6、运通105、运通110、运通205;A口,319、331、365、375、438、498、562、579、601、614、628、656、681、717、特6、运通105、运通205;B口,319、331、365、375、438、498、562、579、601、614、628、656、681、717、特6、运通105、运通205;",
        @"中关村@B口,333外环、384、47、626、696、983支、运通113、运通109;C1口,302、307、320、320区间、332、355、365、466、601、608、681、683、697、699、717、718、731、运通105、运通106、运通205、特4、特6;D口,302、307、320、320区间、332、355、365、601、608、681、683、697、699、717、718、731、运通105、运通106、运通205、特4、特6;A口,无;E口,无;",
        @"海淀黄庄@A口,85、304、307、320、332、355、365、386、601、608、611、614、630、671、681、683、697、699、717、718、731、944、特4、特6、运通105、运通106、运通109、运通205;B口,304、386、611、630、653、671、944、运通109;C口,304、386、611、630、653、671、944、运通109;D口,302、304、320、386、601、608、611、630、653、671、689、717、731、944、特4、特6、运通109;",
        @"人民大学@A1口,26、79、85、300、320、323、332、355、365、384、425、601、608、614、651、683、697、699、717、718、特4、特6、特8、运通101、运通105、运通106、运通201、运通205、夜209;A2口,85、320、332、355、365、384、601、608、614、683、697、699、717、718、特4、特6、运通105、运通106、运通201、运通205、夜209;B口,79、302、361、367、384、422、425、601、614、617、651、658、660、683、695、731、特8、运通101、运通201;C口,26、79、302、361、367、422、425、601、614、617、651、658、660、683、695、731、特8、运通101、运通201;D口,26、79、300、323、355、365、425、651、特8、运通101、运通201;",
        @"魏公村@A口,26、85、320、332、608、651、653、689、697、717、特4、特6、运通105、运通106、运通205、夜209;B口,26、85、320、332、608、651、653、660、689、697、717、特4、特6、运通105、运通106、运通205、夜209;D口,26、320、332、563、608、620、651、653、660、689、695、697、717、特4、特6、运通103、运通105、运通106、运通205、夜209;",
        @"国家图书馆@A口,86、319、320、320区、332、563、608、614、645、653、689、695、697、717、特4、特6、运通105、运通106、运通205;B口,319、320、332、563、608、614、645、653、689、695、697、717、特4、特6、运通105、运通106、运通205;C口,无;D口,无;",
        @"动物园@A口,27、87、105、107、111、319、347、360、362、534、563、608、632、697、714、运通104、运通105、运通106、运通205、特4、夜206、夜209;C口,7、15、19、26、45、65、102、103、107、319、332、334、360、685、697、717、特4;D口,27、87、102、103、105、107、111、114、118、319、347、360、362、392、534、563、608、632、697、701、717、714、运通104、运通105、运通106、运通205、特4、特5、夜202、夜206、夜209、夜211;B口,无;E口,无;",
        @"西直门@A口,16、26、85、87、360、375、438、563、632、651、运通104、运通105;B口,7、27、44、105、111、347、608、618、特12、运通104、夜206;C口,7、21、44、50、84、105、111、387、490、608、618、691、694、特12;D口,7、16、21、26、27、44、80、84、87、105、111、347、360、362、387、392、490、534、562、563、604、608、618、632、651、691、693、694、运通104、运通105、运通106、运通205、夜206、夜209、特12;",
        @"新街口@A口,7、105、111、608;D口,7、105、111、608;B口,22、47、83、88、105、111、409、508、609;C口,22、47、105、111、608;",
        @"平安里@A口,7、22、38、47、88、111、409、608、609、626、690;B口,22、38、83、88、105、111、409、608、609、626、690;C口,13、22、38、42、68、88、90（90内）、105、107、118、409、609、612、623、626、690、701、夜204;D口,7、13、22、38、42、47、83、88、105、204、409、609、623、626、690、夜204;",
        @"西四@A口,22、38、47、68、102、105、109、603、604、626、夜204;B口,13、22、38、83、88、409、623、626、690、夜204;D口,42、102、603、604、608、619;",
        @"灵境胡同@B口,22、38、88、102、105、109、603、604、690、626、夜204;D口,22、38、47、68、102、105、109、603、604、626、夜204;C口,无;",
        @"西单@F口,10、22、88、690;H口,1、10、37、52、70、83、88、99、102、105、109、603、604、608、626、728、夜204、夜205;J口,7、15、83、102、105、109、603、604、608、626、夜204;",
        @"宣武门@H口,9、54、102、105、109、603、604、673、夜204、夜209;E口,7、9、15、22、37、83、102、105、109、603、604、608、673、夜204、夜209;G口,7、9、15、44、54、67、70、102、105、109、209、603、604、608、特2、特4、特7、夜204、夜212;",
        @"菜市口@A口,5、6、48、54、57、70、102、105、109、381、603、604、613、646、715、743、特5、夜201、夜204;C口,5、6、48、54、70、102、105、381、603、604、613、646、715、特5、夜201、夜204;D口,5、6、48、57、109、381、613、715、743、特5、夜201;",
        @"陶然亭@A口,604;C口,40、59、613、夜213;D口,604;",
        @"北京南站@A口,529、特8内、特5、343、652、特17、665、夜15、夜24;",
        @"马家堡@A口,54、485、646;C口,51、66、485、501、529、603、698、707;B口,54、485、646;",
        @"角门西@A口,48、51、54、66、377、474、501、529、603、646、698、707、专26;B口,51、54、66、485、501、529、603、646、698、707;C口,646、专26;D口,48、51、54、66、377、501、529、646、698、707、特8外环、专26;",
        @"公益西桥@A口,48、54、66、474、556、646、698、707、特8外环、运通125、专26;C口,377、474、511、556、646、825、990、运通125、专26;B口,474、556、646、运通125、专26;D口,377、511、556;E口,无;",
        @"宋家庄@A口,511;B口,652、运通202;C口,524、684、990;D口,17、990、511;",
        @"刘家窑@A口,723、7、957、39、43、686、17、434、654、954、927、51、741、368、826、627、732、973、652、988、300、特8、300快、957快、957快1、927区、运通107、运通202;B口,39、43、723、957、957、快1、957、快2;C口,12、17、723、434、300、39、300快、特8、运通107、运通202、51;D口,741、434、627、988、973、957、686、17、654、43、51、732、652、954、927、957支、957、快1、957、快2、927区、运通107、运通202;",
        @"蒲黄榆@A口,986;B口,特3、599、39、43、705、723、特12、800、813、122、53、812、957、72、快1;C口,25、39、43、723、685、特12、800、957;D口,599、39、43、686、723、957、827、829;",
        @"天坛东门@A口,743、6、34、25、39、43、41、60、116、525、687、684;B口,6、34、41、36、35、60、116、705;C口,36、29、39、827、958、685、705、725、686;D口,暂未开通;",
        @"磁器口@A口,23、57、715、106、614、685、41、723、60、208、684、625、204;D口,23、57、715、  特7、614、39、204、60、610、116、25、43、525;",
        @"崇文门@A口,59、44、9、8、60、106（电车）、41、108（电车）、684、110、685、111（电车）、116、622、623、特2、127（电车） 夜10(内）;B口,108（电车）、111（电车）、103（电车）、104（电车）、127（电车）、夜10(内）、957、674、29、39 ;C口,814、684、610、685、204、25、116、723、525、43、39、8、12、60、103、104、211;D口,684、685、25、116、622、623、525、43、39、8、12、60、103（电车）、104（电车）、特7、673 、夜10（外）、特2;",
        @"东单@A口,1、52、106（电车）、110、120、126、116、684、685、111（电车）、99、127（电车）、108（电车） 夜10(内）;B口,685、106（电车）、110、39、夜10(内）、108（电车）、111（电车）、684 ;C口,684、685、25、127（电车）、39 、夜10（外）;D口,110、116、684、685、41、1、52、99、127（电车）、126、120;",
        @"灯市口@A口,110、116、684、685 夜10(内）;C口,110、116、684、106（电车）、108（电车）、111（电车）、夜10（外）;",
        @"东四@B口,116、夜10(内）、684、106（电车）、101（电车）、109（电车）、112（电车）、420、58;C口,112（电车）、101（电车）、109（电车）、420 、58 、夜10（外）;D口,110、420、109（电车）、112（电车）、685、684、106（电车）、116、110 、夜10（外）;",
        @"张自忠路@A口,116、106（电车）、夜10(内）684、13、118（电车）、115（电车）、701、42、113、3 ;B口,13、116、106（电车）、684、夜10(内）;C口,106（电车）、684 、夜10（外）;D口,106（电车）、684 、夜10（外）;",
        @"北新桥@A口,107（电车）、635、612、13、684、117、夜10(内）;B口,13、117、684、夜10(内）;C口,106（电车）、116、684 、13、夜10（外）;D口,107（电车）、635、612、106（电车）、116、684、夜10（外）;",
        @"雍和宫@A口,125、636;C口,116、117、13、684、636;D口,116、117、13、684、636;",
        @"和平里北街@A口,125、13、62、117、123、201、406、674、684、127;B口,117、201、127、125;C口,125;D口,125;",
        @"和平西桥@A口,985、特8、207、117、607、718、671、641、407、601、367、422、361、运通104、运通201;B口,300快、671、607、特8、985、718、641、601、207、117、367、464、547、847、75、运通104;C口,125、430、75;D口,125、430、75;",
        @"惠新西街南口@A口,515;B口,430;C口,515、125、101、201;D口,515、125、464、101、201;",
        @"惠新西街北口@A口,特9、特16、386、419、689、696、658、944、983、408、740、479、656、753、379、运通110、运通113;B口,无;C口,运通101、运通201、464、125、18;",
        @"大屯路东@A1口,484、913、596、695、751、专40;A2口,暂缓开通;B1口,专40、415、484、569、751、913;B2口,464、479、538、558、569、620、628、215夜;",
        @"北苑路北@A1口,466/484/984/620/695/653/617/特11/运通117/464/430/751/985/215夜/479/593/319 ;A2口,专37/593/专120;B1口,无;B2口,215夜/415/466/484/695/426/479/617/751/653/430/运通117/620/464/984/596/905/特11/593/319;",
        @"立水桥南@A口,464 620 751 966 621 117 107 81;C口,966 621 517 464 620 629 751 117 984 617 558 758 479;D口,466 596 653 484 117 464 558 620 11 758 751 107;",
        @"立水桥@A口,无;B1口,966、465、517、621、629、558、617、464、快3、984、479、620、430、751、426、运通117;B2口,966、465、517、621、629、558、617、464、快3、984、479、620、430、751、426、运通117;",
        @"天通苑南@A口,快速公交3路、984、985、昌52、昌59、昌51、快速公交3路、984、985、昌52、昌59、昌51、984、快速公交3路;",
        @"天通苑@A口,118、315、426、430、465、464、621、617、432、905、922、984、昌27、昌52、昌22;B口,118、315、426、430、465、464、621、617、432、905、922、984、昌27、昌52、昌22;",
        @"天通苑北@B口,643、860、441、520、522、537、617、933、966、984、985、428、426、430专117、快3、昌22、昌52;",
        @"海淀五路居@A口,61、运通110、运通113、运通118、121、334、489、505、588、603、507、981;B口,73、335、336、快速公交4线支;C口,61、92、414、653;D口,79、运通110、运通114、334、355、111、118、113、507、121;",
        @"慈寿寺@B口,27、33、40、481、489、507、588、613、632;C1口,27、33、40、481、507、588、613、632;C2口,61、73、40、481、613、33、632;D口,61、73;H口,61、73、40、481、613、33、632、507;I口,61、73、92、335、588;",
        @"花园桥@A口,300外、92、61;B1、B2口,392、夜202、323、394、118、74、77、特8内、300内61、27、86、701;C口,968、693、27、392、394、658、202、86、61、301、374、967、944、653、617、74、620、运通103、运通201、夜班202;D1、D2口,392、394、73、658、61、86、374、967、944、653、27、617、74、620、968、693、27、77、323、特8外、运通108、运通103、运通201;",
        @"白石桥南@A口,27 114 86 92 653 118 717 特6 211夜 特18;B口,27 114 86 653 118 332 717 92 360快 特6 211夜 特18 482;C口,114 693 118 695 特6 392 701 717 202夜 特18 92 61 645;E口,27 701 86 118 61 392 653 202夜;G口,27 701 86 61 392 653 202夜 645 61;",
        @"车公庄西@A口,614、701、714、45、特19、26、65、388、15;B口,45、71、614、15、26、65、19、特19;C口,19、26、45、107、118、特19;",
        @"车公庄@A口,运通106、21、375、632、604、80、693路、44外、特12外、夜209;B口,50、80、209、375、604、632、693、运通106路;E口,19、107、118、209、693、685、701、特4路;H口,21、50、80、90外、209、604、运通106路;",
        @"平安里@E口,7路、47路;F口,38路、409路、特13路、111路、701路、88路、105路;G口,42路、90内路、105路、107路、118路;H口,7路、47路、107路、118路;",
        @"北海北@A口,3路、13路、111路、612路、107路、42路、701路、118路、夜3路、夜10外路、夜21路;B口,3路、13路、111路、612路、107路、42路、701路、118路、夜3路、夜10外路、夜21路;D口,3路、13路、111路、612路、107路、42路、701路、118路、夜3路、夜10外路、夜21路;",
        @"南锣鼓巷@A口,3路、60路、612路、107路、108路;B口,118路、3路、60路、82路、104路、127路、108路、113路、115路;",
        @"东四@E口,619路、685路、609路、107路、109路、112路、420路;G口,106路、116路、684路、685路、110路;",
        @"朝阳门@F口,101 109 112 420;H口,674 24 110 420 101 109 112 58 夜13;G口,101 109 112 420 202 609 619;",
        @"东大桥@A口,43 110 118 120 75 515 101 109 112 650 夜24 夜13;B口,28 75 330 433 126 快速公交2;D1口,75 101 109 118 515 112 126 420 433 512 615 650 619 350;D2口,;",
        @"呼家楼@E口,75 126 420 650;H口,无;G口,快速公交2;",
        @"金台路@B口,75 486 440 31 682 726 729 635;C口,30 75 117 126 419 440 486 502 612 682 973 976 984 985 ;D口,117 419 502 30 612 973 976 985 984 988 31 306 486;",
        @"十里堡@B口,440 486 595 640;C口,595;D口,75 126 306 440 486;",
        @"青年路@B口,75、运通111、运通121、553、468、494、126、306、499、628、675、911;C口,911、675;D口,408、911、682、675、306、494、75、419、628、126;",
        @"褡裢坡@B口,731区、306、499、675、911、517;C口,306、499、675、731区、911、583、517;D口,517、731区;",
        @"黄渠@A口,583;B口,583、911、517、675、499、306;C口,499、675、517、306、731区;D口,无;",
        @"常营@B口,499、731区、专115、911、306;E口,342、911、586、585、306、587、675;F口,342、587;",
        @"草房@A口,586、585、342、675、639、582、587、通6、911、306、566、731区;B口,731区、566;C口,813、819、824、306、639、675;D口,582、通6、675、587、306、342、911、639;",
        @"物资学院路@A口,342、582、587、675、815、 824、911、通6;B口,824、911;D口,342、582、587、通6;",
        @"通州北关@A口,通14、587、648、911、924、通2、316、342;B口,无;",
        @"北运河西@A口,552、809、317;B口,无;",
        @"郝家府@A口,无;B口,无;C口,无;D口,无;",
        @"东夏园@A口,无;B口,无;C口,无;",
        @"潞城@口,;",
        @"北京西站@A口,特2 9 21 40 50 52 65 67 89 运通102 205夜 209夜 212夜 213夜 特14 特13 特19 特18 301 373 374 387 388 414 616 661 662 663 673 694 695 741 840 843 845 901快;B口,专3 53 109 122 309 349 410 616 820 890 890（担扎） 941 941快 982 特17;",
        @"湾子@A口,687、691、340、410、613、53、6、122、477、715、38、45、57、76、109、390、特7、夜7、夜22、;C口,46、89、414、38、45、46、122、53、57、6、477、特7、76、109、340、390、613、687、715、691、夜7、夜22、410;D口,无;",
        @"达官营@B口,45、76、687、691、夜7、夜22、42、46、390、410、613、638、特7、46、57、687、42、715、53、122、340、80、109、477;C口,38、109、477、715、57、122、夜7、夜22;D口,6、42、53、109、477、613、夜22、38、46、76、122、夜7、410、;",
        @"广安门内@A口,特5、38、57、109、477、夜7、687、836、837慢、837快、715、6、5、613、835、;B口,613、477、特5、109、717、381、5、6、715、38、57、夜7、687、;C口,717、夜7、57、687、715、6、38、;",
        @"菜市口@C口,5、6、48、102、105、603、715、夜班车201、204、;D口,5、6、48、57、70、102、105、109、381、603、604、613、715、夜班车201、204、特5、特14、;E口,5、6、48、57、70、102、105、109、381、603、604、613、715、夜班车201、204、特5、特14、;F口,5、6、48、57、70、102、105、109、381、603、604、613、715、夜班车201、204、特5、特14、;",
        @"虎坊桥@A口,特5、48、夜7、夜10内、57、5、6、105、687、夜18、23、34、715;C口,5、23、48、57、715、夜10内、夜10外、夜18、夜7、102、105、14、66;D口,特5、48、夜7、夜10内、57、5、6、105、687、夜18、23、34、715;",
        @"珠市口@A口,23、57、夜7、715、夜10内;C口,23、57、夜7、715、夜10外;D口,48、23、57、5、夜7、715、夜10外、夜18、17、69、120、93、20、59、夜17、观光1线;",
        @"桥湾@B口,23、57、715、夜7、夜10内、110;C口,23、57、715、夜7、夜10内、110;D口,23、57、715、夜7、夜11内;",
        @"磁器口@F口,23路、57路、715路、夜7路、夜28路、25路、39路、41路、106路、60路、夜24路;G口,23路、57路、715路、夜7路、夜28路;H口,43路、116路、525路;",
        @"广渠门内@A口,8、23、715、夜7、12环行;B口,8、23、715、夜7、12环行;D口,8、23、715、夜7、;",
        @"广渠门外@A口,23、57、637、715、夜7;B口,23、57、637、715、夜7;D口,23、57、637、715、夜7;",
        @"九龙山@E口,11、30、23、35、348、715、专87、621、988、985、983、486、665、382、677、夜25、605;G口,382、915、23、35、486、348、715、专87、38、30、605、621、 夜7、夜25、973、11、988、513、688、541、478;",
        @"大郊亭@A口,11、23、35、348、513、541;B口,无;C口,31、865、740、657、439、11、23、35、513、541、夜34;",
        @"百子湾@A1口,581、439、23、11、31;A2口,23、31、541、11、581、455、363;A3口,11、541、581、31、23、455;B口,439、11、31、23、581;",
        @"化工@A口,无;C口,无;D口,无;",
        @"南楼梓庄@A口,30、31、34、41、 561、657、457、 34(夜);B口,348、535、637、457、19(夜);C口,无;D口,41、561、657;",
        @"欢乐谷景区@B口,无;C口,41、34(夜)、31、674、680、687;",
        @"双合@A口,348、457、561、 637;B口,无;C口,无;",
        @"焦化厂@A口,无;B口,无;C口,无;D口,457、637、638 、677;",
        @"朱辛庄@B口,463路; 昌19路; 专49路; 专49区; 专50路;A口,无;",
        @"育知路@D口,昌25路；463路; 560路; 昌19路; 专80路;A口,无;B口,无;",
        @"平西府@D口,443、996、428;B口,无;",
        @"回龙观东大街@A口,443路; 462路; 558路; 996路; 专101路; 专42路;D口,443路; 462路; 558路; 996路; 专101路; 专42路;B口,无;C口,无;",
        @"霍营@E口,551路; 558路;F口,371路; 462路; 478路; 607路; 681路;专104路; 专21路; 专42路;G口,无;H口,无;",
        @"育新@A口,315路; 371路; 432路; 462路; 478路; 592路; 606路; 607路; 609路; 614路; 专104路; 专89路;B口,无;C口,无;D口,运通117线; 运通119线;",
        @"西小口@A口,专89;B口,无;C口,无;D口,无;",
        @"永泰庄@A口,专90、81、456；305路; 476路; 490路; 专43路;C口,81路; 专89路;",
        @"林萃桥@A口,无;C口,81路; 510路; 专44路;D口,无;",
        @"森林公园南门@A口,无;B口,无;C口,无;D口,无;",
        @"奥林匹克公园@A口,无;B口,311路; 328路; 379路; 484路; 594路; 617路; 751路; 913路; 运通110线; 专40路;C口,无;D口,无;E口,无;",
        @"奥体中心@C口,无;D口,无;B口,无;",
        @"北土城@A口,无;B口,407路; 607路;C口,5路; 81路; 84路; 92路; 515路; 特8外快;D口,5路; 21路; 81路; 82路; 84路; 92路; 113路; 620路; 653路; 夜6路; 夜9路;",
        @"安华桥@A口,5路；300内; 300外; 302路; 361路; 367路; 387路; 601路; 641路; 671路; 847路; 848路; 特8内; 特8外; 夜30内; 夜30外; 运通101线; 运通104线; 运通201线；;B口,21路; 113路; 407路; 409路; 607路; 特8外快; 夜6路;C口,无;D口,无;E口,82路; 113路; 380路; 409路; 特2路; 夜6路;",
        @"鼓楼大街@E口,44内、特12内、夜20内、409、909;F口,60、80;G口,无;",
        @"什刹海@A口,107、124、60、82、5、夜2、夜10外;C口,107、124、60、82、5、夜2、夜10外;",
        @"南锣鼓巷@E口,612、13、3、60、118、夜3、夜21;F口,612、13、3、60、118、夜3、夜21;",
        @"郭公庄@A口,无;B口,无;C口,无;D口,临3;",
        @"丰台科技园@A口,无;B口,无;C口,无;D口,临3;",
        @"科怡路@A口,340 604 687 694;B口,340 604 687 694;C口,740 特9 运通115;D口,无;",
        @"丰台南路@A口,351 692 845 353 691 627;D口,无;",
        @"丰台东大街@A口,335 845 978 349 451 477 459 678 395 912;C口,335 451 477 459 678 395 912;",
        @"七里庄@A口,205夜 323 973 458 531 654 839 480 604 687 699 840 998 969 特7 830快 830 896;B口,451 477 77;C口,205夜 323 973 458 531 654 839 480 604 840 998 特7 658;",
        @"六里桥@A口,477 309 941 982 340;B口,477 309 941 982 50 340;C口,无;D口,运通201 ;E口,专3;",
        @"六里桥东@C口,特7 57 74 76 运通120 201夜 309 321 349 390 394 477 613 691 715 832 835 835快 821 890 820;D口,890 832 691 特7 74 835快 专3 运通120 321 394 57 201夜 390 715 349 613 820 821 838 477 309 76 982;E口,6 特7 38 57 74 76 201夜 309 321 349 390 394 477 613 691 715 820 821 832 835 838（跨省）890 982 专3;",
        @"北京西站@A口,特2 9 21 40 50 52 65 67 89 运通102 205夜 209夜 212夜 213夜 特14 特13 特19 特18 301 373 374 387 388 414 616 661 662 663 673 694 695 741 840 843 845 901快;B口,专3 53 109 122 309 349 410 616 820 890 890（担扎） 941 941快 982 特17;",
        @"军事博物馆@A口,21 78 388 205夜;B口,1 21 52 68 78 94 99 308 337 特18 夜1 夜8;C口,1 21 65 68 78 99 308;D口,337 特18;E口,337 99 1 308 特18;G口,21 99 414 388 夜212;H口,1 89 52 68;",
        @"白堆子@A口,612 61 92 快速公交4;B口,运通106 92 61 37 56 603 121;C口,快速公交4 603 121 37 61 56 运通106;D口,612 92;",
        @"白石桥南@A口,27 114 86 92 653 118 717 特6 211夜 特18;B口,27 114 86 653 118 332 717 92 360快 特6 211夜 特18 482;C口,114 693 118 695 特6 392 701 717 202夜 特18 92 61 645;E口,27 701 86 118 61 392 653 202夜;G口,27 701 86 61 392 653 202夜 645 61;",
        @"国家图书馆@A口,319 320 320区间 332 563 608 614 645 653 689 695 697 717 86 特4 特6 运通105 运通106 运通205 公交旅游专线;B口,319 320 332 563 608 614 645 653 689 695 697 717 特4 特6 运通105 运通106 运通205 公交旅游专线;C口,332 公交旅游专线 645 ;D口,无;",
        @"巴沟@C口,304、307、361、394、630;A口,无;B口,无;",
        @"苏州街@A口,374、304、307、361、394、630、671;B口,无;C口,无;D口,无;",
        @"海淀黄庄@C1口,304、386、611、630、653、671、944、夜9、运通109;D口,302、549、601、608、653、689、717、特18、特4、特6、夜8;C2口,无;A口,85、304、307、320、332、355、365、386、601、608、611、614、630、671、681、683、697、699、717、718、731、944、特4、特6、运通105、运通106、运通109、运通205;B口,304、386、611、630、653、671、944、运通109;",
        @"知春里@A口,无;B口,无;D口,304、323、386、579、611、630、653、671、689、944、夜9、运通109线;",
        @"知春路@G口,79、304、386、689、579、671、944、653、641、夜9;F口,641、944、653、579、311、630、751、夜9;",
        @"西土城@A口,304、386、夜9;B口,375、392、490、94、21、658、478、运通103、夜9、夜13;C口,运通103、夜14、375、490、498、562、617、304、21、392、606、658、94;D口,运通103、94、304、375、392、21、490、498、671、658;",
        @"牡丹园@A口,658、641、84、653、21、579、16、47、331、425、635、645;B口,无;C口,21、58、510、620、92、653、345、618、919、夜9;D口,55、641、305、315、625、670、夜2、特13;",
        @"健德门@A口,21、620、653、84、510、618、641、658、889 、夜9;C口,21、58、510、620、92、653、345、618、919、夜9;D口,55、641、305、315、625、670、夜2、特13;",
        @"北土城@A口,407、607;B口,407、607;C口,84、645、515、81、90内、380、409、620、653、649、90外、607、407、运117、21、906、特2、82;D口,81、113、653、520、82、81、84、607、380、92、620、409;",
        @"安贞门@A口,380、409、515、夜9 ;C口,104、108、124、426、758、快速公交3号线、409、515、90;D口,无;",
        @"惠新西街南口@A口,515;B口,430;C口,515、125、464、运101、运201;D口,515、125、464、运101、运201;",
        @"芍药居@F口,515、567、547、 942;E口,119、547、942快、专22 ;G口,;",
        @"太阳宫@A口,130、132、467、515、567、939、966、985、专122;B口,·;C口,;D口,;",
        @"三元桥@C口,852、867、918、936路青龙峡、536;D口,;",
        @"亮马桥@A口,413、418、536、675、688、955;B口,402、413、418、419、420、503、516、688、701、707、909、955、985、运通107;C口,405、416、420、421、499、503、516、601、671、672、675、701、984、特3、运通107;D口,420、499、516、671、421、701、718、601、701、405、416、675、672、984、特3;",
        @"农业展览馆@A口,405、718、416、421、302、499、732、675、974、909、夜207、402、671、701、984、516、672;D口,420、707、701、974、984、运通122、402、405、421、635、运通107、671、718、601、夜207、731;",
        @"团结湖@A口,627、402、718、671、635、758、113、115、117、406、984、707、421、420、405、701、974、801、431、416、特3、运通107;B口,402、420、701、421、405、707、627、635、984、671、718、801、974、117、夜207、运通107、特3;C口,801、974、113、350、673、406、431、686、650、122;D口,113、115、117、758、350、650;",
        @"呼家楼@B口,特3、421、671、特8、503、707、402、627;C口,421、113、402、420、405、特8;D口,405、750、113、601;E口,75、126、420、440、650;G口,快速公交2;",
        @"金台夕照@A口,9、113、402、405、488、601、619、686、707、974、特8内; 夜30内; 夜34、运通107线;B口,车次：9、433、488、619、671、快速公交2线; 快速公交2线区间; 夜13路;C口,98、488、夜30外;、夜34;D口,;",
        @"国贸@E1口,9、99左安路—北京西站609、938香;E2口,4、113、402、405、421、503、683、686、707、107、57、668、801;F口,9、特3、402、421、488、502、113、683、运通107、405、601、707、686、特8、503、808;G口口,无;",
        @"双井@A口,28、57、91、98、99、300快内、300快外、300内、300外、348、601、686、707、974、特8内、特8内快、特8外、特8外快、夜30内、夜30外、运通107线、专10、专87路 ;D口,23、637、715、夜7、专87路;B口,无;",
        @"劲松@C口,29、41、52、98、457、535、541、561、601、637、687、特3、夜19路、28、99、352、638、974、夜30内、夜30外、运通107线 ;A口,;B口,;D口,;",
        @"潘家园@A口,34、368、674;B口,34、运通107、638、974、28、夜30;C1口,;C2口,;",
        @"十里河@A口,28、30外、特8;B口,无;D口,无;",
        @"分钟寺@A口,352;B口,无;D口,无;",
        @"成寿寺@A口,654、665、680、985、626、25;C2口,990、213、685;B口,无;C1口,无;",
        @"宋家庄@A口,无;B口,无;E口,无;F口,无;",
        @"石榴庄@C口,69、525、820、829、特11、夜28路;D口,无;",
        @"大红门@D口,运通103、快速公交1、504、526、686、324、613、573、622、826、926、954、997;A1口,;A2口,;C口,;",
        @"角门东@A口,14、70、343、501、613、957、运通107线;D2口,14、511、运通125线;B口,无;C口,无;D1口,无;",
        @"角门西@A口,51、501、529、698、707、特14、夜18、运通125线;E口,51、474、501、529、556、646、698、707、特14、夜18、专26;G口,474、556、646、运通125线; 专26路;F口,无;",
        @"草桥@A口,529;B口,529;",
        @"纪家庙@A口,;B口,;D口,;",
        @"首经贸@D口,临5;B口,无;C口,无;",
        @"丰台站@C1口,49、67、351;C2口,临5、专4;D口,无;",
        @"泥洼@A口,678、395、912、349、845、459;B口,678、395、912、349、845、459 ;C口,无;",
        @"西局@A口,323、458、480、483、531、604、658、687、830、839、840、896、958、969、973、978、998、夜36、特7;C口,无;D口,无;",
        @"六里桥@A口,340 604 687 694;B口,340 604 687 694;C口,740 特9 运通115;",
        @"莲花桥@B口,52、373;C口,323、631、890、944、969;D口,无;",
        @"公主坟@B口,1、23、32、33、40、52、99、68、74、76、89、308、323、337、368、370、373、374、394、436、437、451、483、613、604、631、698、699、728、944、968、977、运通102、运通108、运通201、运通203;C口,1、40、52、57、68、74、76、300、308、323、368、378、394、437、483、89、613、699、728、94、977、968、特8、运通103、运通102、运通108运通120;D口,1、32、33、52、64、68、74、76、77、89、300、323、324、335、368、370、373、374、431、427、483、613、624、631、699、617、944、特8;",
        @"西钓鱼台@A口,27、40、56、87、92、97、121、368、603、612、645、653、693、698、701、967、977快; 977快定班; 977、快速公交4线; 夜13、夜16、运通102线; 运通106线;C口,33、335、414、481、613、632、夜16路;",
        @"慈寿寺@B口,27、33、40、481、489、507、588、613、632;C口,27、33、40、481、507、588、613、632、61、73、夜3;D口,61、73、夜3;A口,无;",
        @"车道沟@A口,360快、714、运通124;B口,87、114、334、347、360慢、360快、437、482、588、632、689、714、特10、运通104、运通109、运通110、夜12;C口,27、40、87、360慢、437、481、482、613、114、334、347、360快、588、632、689、714、特10、运通104、运通109、运通110、夜12;D口,114、469、482、588、714、运通104、运通109、运通110、运通124、夜12;",
        @"长春桥@A口,74、437、481、运通124;D口,74、437、481、运通124、33、79、355、360慢、365、425、539、611、664、992、运通101、运通114、运通118；;",
        @"火器营@A口,74、437、481、运通124、360慢、365、539;C口,437、481、运通124、74;",
        @"西直门@E口,16、 26、 87;F口,无;",
        @"大钟寺@A口,123、 425、 88、 87、 特8;",
        @"知春路@B口,夜9路;A口,689路;",
        @"五道口@A口,无;B口,无;",
        @"上地@A口,447、448、449;",
        @"西二旗@A口,509、717、664、504、521;B口,专34、636、333、570、963、392、运114、521、447、运112、996、运205;",
        @"龙泽@A口,专103;",
        @"回龙观@A口,878、 880、 887、 557、 121;",
        @"霍营@A口,371、 462、 478、 607、 681;",
        @"立水桥@A口,无;",
        @"北苑@A口,484、 682;",
        @"望京西@B口,451、 457、 976、 966、 471、 470、 854、 445、 446、 980;A口,无;",
        @"芍药居@A口,119、 547、 942、 专22  ;B口,942、 547;",
        @"光熙门@A口,特8、运104、300、302、367、379、419、641、671、718、731、801、916快、954;B口,无;",
        @"柳芳@A口,123 130;",
        @"东直门@H口,24路、106电车、107电车、117路、123路、131路、132路、206夜班、401路、404路、413路、416路(环行).418路、3路、635路、688路、909路、850路、915路、916路、916快车、918快车[官庄道口]、918路、918空调、934路、966路、980快车、980路、987路、850快、852路;G口,无;",
        @"张郭庄@A口,565路; 574路; 830路;B口,565路; 574路; 830路;",
        @"园博园@A口,55、565、391;B口,574、897、830、944;C口,无;",
        @"大瓦窑@A口,546、598、973、339、专17路;B口,无;",
        @"郭庄子@A口,无;B口,554路、339路、634路;D口,无;C口,507路;",
        @"大井@A口,323快、458、 830; 978;B口,无;",
        @"七里庄@G口,77路; 658路; 夜16路;E口,323路; 特7路;H口,687、458、604、654、480、531;",
        @"西局@E口,83路; 323路; 458路; 480路; 483路; 531路; 658路; 830路; 839路; 840路; 896路; 958路; 969路; 973路; 978路; 998路; 特7路; 夜36路;F口,83路; 323路; 483路; 531路; 658路; 958路; 969路; 夜36路;",
        @"俸伯@A口,顺15路、顺23路、顺36路、顺39路、顺40路、顺31路、顺33路、顺33路（区）、顺36路、顺37路、顺39路、顺40路、顺41路、顺45路、顺18路、顺28路、924路、915路、856路、970路、918慢、923路、945、空港7路、空港8路;C口,顺15路、顺16路、顺23路、顺36路、顺39路、顺40路、924路、915路（快车）、918慢、915路、856路、970路、923路、945路、空港7路、空港8路、顺18路、顺28路、顺31路、顺33路、顺37路、顺39路、顺41路、顺45路、顺33路（区）;B口,无;",
        @"顺义@B口,顺1路、顺15路、顺16路、顺20路、顺23路、顺24路、顺25路、顺26路、顺37路、顺41路、顺5路;C口,顺1路、顺15路、顺16路、顺18路、顺19路、顺20路、顺23路、顺24路、顺25路、顺26路、顺31路、顺33路、顺37路、顺39路、顺40路、顺41路、顺45路、945、915、850、856;D口,D口：顺12路、顺14路、顺18路、顺19路、顺28路、顺31路、顺34路、顺38路、顺39路、顺40路、顺11路、顺16路、顺17路、顺21路、顺22路、顺23路、顺24路、顺29路、顺33路、顺36路、顺37路、顺41路、945路、顺32路、顺43路、顺15路、顺1路、顺2路、顺20路、顺25路、顺26路、顺27路、850路、856路、915路、顺3路、顺39路、空港2路;A口,无;",
        @"石门@A口,顺2路、顺12路、顺27路、顺28路、顺29路、顺32路、顺36路、顺37路、顺38路、顺43路、顺4路、915路、915（快）;B口,顺4路、顺18路、顺27路、顺28路、顺36路、顺37路、顺43路;C口,915（快）、顺45路;",
        @"南法信@A口,顺2路;B口,顺2路、顺4路;C口,顺2路、顺27路、顺28路、顺38路;D口,顺27路;",
        @"后沙峪@B口,空港3路、顺26路、顺28路、顺31路、915、916、918、923、934、936、955、942、942支、970、980、987;A口,无;C口,无;D口,无;",
        @"花梨坎@C口,空港3路、顺31路、915、918、923、933、955;A口,;B口,;D口,;",
        @"国展@B口,915、918、923、933、955、空港3路;C口,915、918、923、933、955、空港3路、顺22路、850、916;D口,933、942、顺22路;A口,无;",
        @"孙河@A口,915、942、850;D口,915、942、696、405、934、538、923、415、987、918、970、980、916、936、942支、915支3、915支3（区间）;",
        @"马泉营@B口,988、944;A口,无;C口,无;",
        @"崔各庄@B口,944、991、415、专116;D口,991;",
        @"望京@A口,421、538、420、470、471、621、851、991、运通104路;C口,运通110、运通113、运通111、运通103、运通201、416环、660、422、361、627、567、682、966、939、132、409、130、131、404、629、707、944、677、976、538、855;",
        @"望京西@C口,928、946、547、976、538、470、471、445、446、851、422、571;D口,通勤快车（燕郊）、854  851、470、471、445、446、571、946;",
        @"关庄@C口,569、658、694;",
        @"安立路@A口,无;B口,108、124、 311、 319、 425、 425快车、 484、 538、594、617、695、751、913、机场大巴上地、奥运村线; 专40路;C口,无;D口,108、124、379、415、 419、426、518、538、653、 905、984、特11、专41路;",
        @"奥林匹克公园@G口,311路、328路、379路、484路、594路、617路、751路、913路、运通110线、专40路;F口,311路、328路、379路、484路、594路、617路、751路、913路、运通110线、专40路;H口,311路、328路、379路、484路、594路、617路、751路、913路、运通110线、专40路;I口,311路、328路、379路、484路、594路、617路、751路、913路、运通110线、专40路;",
        @"北沙滩@A口,379路、407路;B1口,307路、345路（慢车）、625路、670路;B2口,328路、425路、607路、夜14路、特15路、484路、518路、617路、695路、913路;C口,305路、407路、特13路、618路、909路、315路;",
        @"六道口@A1口,355路、438路、594路、913路、运通110线;A2口,运通103路、398路、478路、490路、夜4路、392路、753路;B口,609路、632路、693路、夜14路;C口,26路、577路、594路;D口,夜14路、特15路;",
        @"清华东路西口@B口,466路、355路、438路、594路; 913路、运通110线;C口,专12路、333内; 333外;",
        @"四惠@A口,1 57 312 322 363 397 402 405 455 468 475 496 506 648 657 666 984 989 58 382 450 581 553 865 671 205 207 ;B口,657 648 205 312 382 666 581 984 865 989 363;D口,657 740 特9;C口,无;",
        @"四惠东@A口,312 382 397 468 475 506 553 581 666 运通121 450;B口,无;",
        @"高碑店@A口,312、397、475、506、666;B口,312、397、475、506、666;",
        @"传媒大学@A口,312、397、506、666;B口,无;C口,312、397、506、666、475;",
        @"双桥@A口,312、397、475、506;B口,312、666;",
        @"管庄@A口,312 666;B口,312 666;",
        @"八里桥@A口,312、615;B口,312、615、666、667、668、669;",
        @"通州北苑@A口,316、317、372、435、805、924、938、通4、通9、通10、通11、通12、通15、通19;B口,316、317、372、435、801、805、938、通3、通9、通10、通11、通13、通15、通19;",
        @"果园@A口,668、801、805、938、通10、通11、通12、通46;B口,36、316、435、552、591、通36、通46;",
        @"九棵树@A口,668、938、938支1、976、通13、通32、通35;B口,668、801、810、938、938支1、938支5、976、通7、通8、通10、通12、通13、通32、通35;",
        @"梨园@A口,587、589、801、802、805、806、810、938、通5、通9、通10、通13、通14、通15、通34、通41;B口,372、647、587、589、801、802、805、806、810、938、通5、通9、通10、通13、通14、通15、通34、通41;",
        @"临河里@A口,801、802、806、810、924、938、通4、通5、通9、通13、通14、通15、通34、通43;B口,801、802、806、810、924、938、通4、通5、通9、通13、通14、通15、通34、通43;",
        @"土桥@A口,810、805、807、924、938、通9、通13、通14、通32;B口,801、802、806、通9、通13、通14、通34;C口,无;",
        @"南邵@B口,昌31、326、870;C口,昌1、昌2、昌11、昌67、884;A口,870路; 昌28路; 昌31支线; 昌51区; 郊80路; 郊94路；326路; 870路; 884路; 昌11路; 昌1路; 昌2路; 昌31路; 昌51路; 昌59路; 昌67路; 昌平11路;",
        @"沙河高教园@A口,昌52、884;B口,无;",
        @"沙河@A口,670路;昌52路; 昌66路; 专51路;B口,专51路;",
        @"巩华城@A口,专66;B口,无;",
        @"朱辛庄@B口,463路; 昌19路; 专49路; 专49区; 专50路;A口,无;",
        @"生命科学园@B口,543路; 560路; 871路; 运通114线; 运通117线;A口,无;",
        @"西二旗@A口,509、717、664、504、521;B口,专34、636、333、570、963、392、运114、521、447、运112、996、运205;",
        @"宋家庄@C2口,990 524 684;D1口,990 524 684;",
        @"肖村@A口,25路、93路、213路（夜）、654路、665路、680路、685路、723路、990路、运通202路等;B口,无;C口,暂缓开通;D口,特9、740、990等;",
        @"小红门@A口,352;B口,无;C口,暂缓开通;D口,985;",
        @"旧宫@A1口,无;A2口,暂缓开通;B1口,324路、826路、821路、825路、950路、953路、997路; 专25路等;B2口,暂缓开通;",
        @"亦庄桥@A1口,599、626、665、西23、846、运通115、运通202等                        ;A2口,暂缓开通;B1口,无;B2口,暂缓开通;",
        @"亦庄文化园@A1口,无;A2口,暂缓开通;B1口,开发区1路;B2口,暂缓开通;",
        @"万源街@A1口,324路、652路、723路、821路、976路、大兴专3线、运通202路   ;B1口,652路、大兴专3线、运通202路;",
        @"荣京东街@A1口,652路、665路、运通202路  ;A2口,暂缓开通;B1口,652路、665路、运通203路;B2口,暂缓开通;",
        @"荣昌东街@A1口,665、542环行、324、专41、开发区1路;A2口,暂缓开通;B1口,652、453、580、578、兴32、兴32区、兴51、开发区1、2、3、4路;B2口,暂缓开通;",
        @"同济南路@A口,542环形、28-29联运、通12、开发区4路、723、846、821、976、专41、兴32、兴51、专96;B口,976总站;",
        @"经海路@A1口,暂缓开通;A2口,暂缓开通;B1口,523、开发区4路、通12路专线、通28-29路;B2口,暂缓开通;",
        @"次渠南@A口,暂缓开通;B口,暂缓开通;C口,637、986、820、通11;D口,暂缓开通;",
        @"次渠@A口,无;B口,820、986、通11;C口,暂缓开通;D口,637;",
        @"郭公庄@A口,无;B口,无;C口,无;D口,临3;",
        @"大葆台@A口,无;B口,无;C口,480 840 913 969 959 967 981;D口,480 840 913 969 959 967 981;",
        @"稻田@A口,无;B口,391;",
        @"长阳@A口,646、993、房42;B口,房51;",
        @"篱笆房@A口,646、993;B口,房15、房51;",
        @"广阳城@A口,房33 房38 房28 房34 房51;B口,无;",
        @"良乡大学城北@A口,无;B口,无;",
        @"良乡大学城@A口,环1、房34;B口,环1、房34;",
        @"良乡大学城西@A口,环1 房34;B口,环1 房34;",
        @"良乡南关@A口,616 833 835 环1 房15 房33 房34 房39 房50;B口,环1 房15 房33 房34 房39 房50;",
        @"苏庄@A口,993 971 833 917 901区间 环2 房15 房31 房36 房36区间 房42 房46;B口,971 833 917 环2 房15 房31 房36 房36区间 房42 房46;",
        @"东直门@E口,916、966、935快、413、935、955、夜10内、夜10外、850、850快、909、918普、131、夜32、24、117、夜6、635、688;",
        @"三元桥@A口,无;B口,无;",
        @"3号航站楼@3号航站楼口,机场巴士1、2、3、5、6、7、9、10路、空港5、6、8路、航站楼摆渡车;",
        @"2号航站楼@2号航站楼口,机场巴士1、2、3、5、6、7、9、10路、空港1、3、5、6路、航站楼摆渡车;",
        @"公益西桥@A口,48、54、66、474、556、646、698、707、特8外环、运通125、专26;C口,377、474、511、556、646、825、990、运通125、专26;B口,474、556、646、运通125、专26;D口,377、511、556;E口,无;",
        @"新宫@A口,353、369、474、556、827、954、运通115;B口,353、369、474、556、827、954、运通115;C口,无;",
        @"西红门@A口,474、专23、兴36、兴53;B1口,377、454、474、483、631、646、专23、专36、兴14、兴36、兴53、新城3;",
        @"高米店北@A口,631、环城1、新城3、兴36、兴53;B口,377、631、环城1、新城2、新城3、兴14、兴36、兴53;D口,456、631、环城1、新城2、新城3、兴36、兴40;",
        @"高米店南@A口,专24、新城1、兴53;C口,专24;",
        @"枣园@A口,410、610、631、829、841、842、937、940、954、968、兴37、兴47;B口,410、610、631、829、841、842、848、937、940、954、968、兴14、兴36、兴37、新城2;C口,410、610、631、829、841、842、937、940、954、968、兴36、;D口,410、610、631、829、841、842、848、937、940、954、968、兴36、新城3;",
        @"清源路@A口,410、456、610、631、829、841、940、954、968、兴31、兴35、兴37、兴53、新城3;B口,410、456、610、631、829、841、940、954、968、兴23、兴24、兴27、兴30、兴35、兴53、新城3;C口,410、456、610、631、829、940、954、968、兴23、兴24、兴26、兴27、兴28、兴30、兴31、兴35、兴48、新城3;",
        @"黄村西大街@A口,840、专1路、兴17、兴19、新城1;B口,410、456、610、631、631快、829、940、954、968、兴14、兴22、兴28、兴29、兴31、兴33、兴35、兴48、新城3;C口,840、940、947、专1、兴14、兴17、兴19、兴20、兴21、兴22、兴28、兴29、兴30、兴31、兴33、兴35、兴37、新城1、新城3;D口,410、456、610、631、829、840、954、957、968、专1、兴17、兴19、兴22、兴25、兴48、新城1、新城2、环城1;",
        @"黄村火车站@A口,410、456、610、631、829、954、957、968、兴25、兴29、兴36、兴37、兴48、新城2、环城1、环城2;B口,366、369、631、829、947、957、968、兴15、兴16、兴18、兴20、兴21、兴22、兴25、兴29、兴30、兴33、兴36、兴37、新城2、环城1;C口,366、369、631、827、829、840、957、968、兴15、兴16、兴18、兴21、兴22、兴25、兴30、兴33、新城1、新城2、环城1;D口,366、369、631、兴15、兴16、兴21、兴22、兴29、兴30、兴36、专1;",
        @"义和庄@B口,兴48;C口,兴30、兴37;A口,兴48;D口,兴37;",
        @"生物医药基地@B口,842、827、兴21、兴27、兴28、兴28区间、兴30、兴39、兴48、兴21路支、兴55;C口,842、827、兴21、兴27、兴28、兴28区间、兴30、兴39、兴48、兴21路支、兴55;",
        @"天宫院@A口,827、842、兴21、兴27、兴30、兴44、兴48;B口,827、842、兴21、兴27、兴28、兴30、兴48;C口,829、兴21、兴27、兴28、兴30、兴44、新城1;D口,829、兴21、兴27、兴28、兴30、兴44、新城1;",

    };
    _dataware = [NSArray arrayWithObjects:data count: sizeof(data)/sizeof(data[0])];
    _poiware= [NSArray arrayWithObjects:poidata count: sizeof(poidata)/sizeof(poidata[0])];
    _busware= [NSArray arrayWithObjects:busdata count: sizeof(busdata)/sizeof(busdata[0])];
    
    //GraphList *g = ((GraphList*)[_graph pointerValue]);
    _numEdges = [[NSNumber alloc]initWithInt:1];
    _numVertexes = [[NSNumber alloc]initWithInt: sizeof(data)/sizeof(data[0])];
    g->numEdges = 1;
    g->numVertexes = sizeof(data)/sizeof(data[0]);
    
    #ifdef DEBUG
        printf("%d,%d\n", g->numVertexes, g->numEdges);
    #endif
    CGSize rx = [ UIScreen mainScreen ].bounds.size;
    rx = rx.width<rx.height?CGSizeMake(rx.height,rx.width):rx;

    for (int i=0; i<g->numVertexes; i++) {
        NSArray* fragments = [data[i] componentsSeparatedByString:@","];
        if([fragments[1] cStringUsingEncoding:NSUTF32StringEncoding])
        {
            VertexType vstart ={[fragments[0] intValue],
                {0},
                    //[fragments[1] UTF8String],
                    //[fragments[1] lengthOfBytesUsingEncoding:NSUTF8StringEncoding],
                {0},
                ccp(IS_NORMSCREEN?([fragments[2] floatValue]*568/667-44):[fragments[2] floatValue]*rx.width/667,[fragments[3] floatValue]*rx.height/375),[fragments[4] floatValue]};//输入顶点信息
            memset(vstart.staname,0,sizeof(vstart.staname));
            memcpy(vstart.staname,[fragments[1] UTF8String],[fragments[1] lengthOfBytesUsingEncoding:NSUTF8StringEncoding]);
            memset(vstart.poidesc,0,sizeof(vstart.poidesc));
            //memcpy(vstart.poidesc,[poidata[i] UTF8String],[poidata[i] lengthOfBytesUsingEncoding:NSUTF8StringEncoding]);
            //NSLog(@"%@ ",poidata[i]);
            g->adjList[i].data =vstart;
            g->adjList[i].firstedge = NULL;
            for(int j=5;j<fragments.count;j+=2)
            {
                EdgeNode *e;
                //向内存申请空间，生成边表结点
                e = (EdgeNode *)malloc(sizeof(EdgeNode));
                if(e == NULL)
                {
                    fprintf(stderr, "malloc() error.\n");
                    return;
                }
            
                //邻接序号为j
                e->adjvex = [fragments[j] intValue];
                if((j+1)<fragments.count)
                    e->weigth.distance = [fragments[j+1] floatValue];
                //将e指针指向当前顶点指向的结构
                e->next = g->adjList[i].firstedge;
                //将当前顶点的指针指向e
                g->adjList[i].firstedge = e;
            }
        }else
            NSLog(@"%@",@"UNICODE encoding failed");
        
    }
//    VertexType vstart ={0,"", ccp(67.5,217),1};//输入顶点信息
//    g->adjList[0].data =vstart;
//    g->adjList[0].firstedge = NULL;
//    VertexType vend ={1,"", ccp(78.500000,226.000000),1};//输入顶点信息
//    g->adjList[1].data =vend;//输入顶点信息
//    g->adjList[1].firstedge = NULL;
//    EdgeNode *e;
//    EdgeNode *f;
//
//            //向内存申请空间，生成边表结点
//            e = (EdgeNode *)malloc(sizeof(EdgeNode));
//            if(e == NULL)
//            {
//                fprintf(stderr, "malloc() error.\n");
//                return;
//            }
//            //邻接序号为j
//            e->adjvex = 1;
//            //将e指针指向当前顶点指向的结构
//            e->next = g->adjList[0].firstedge;
//            //将当前顶点的指针指向e
//            g->adjList[0].firstedge = e;
//    
//            f = (EdgeNode *)malloc(sizeof(EdgeNode));
//            if(f == NULL)
//            {
//                fprintf(stderr, "malloc() error.\n");
//                return;
//            }
//            f->adjvex = 0;
//            f->next = g->adjList[1].firstedge;
//            g->adjList[1].firstedge = f;
    //    }
#ifdef DEBUG
    printf("%d,%d\n", g->numVertexes, g->numEdges);
#endif

}
- (bool) isTransfer:(int) index{
    NSArray* fragments = [_dataware[index] componentsSeparatedByString:@","];
    return [fragments count]>9;
}

- (void) printGraph{
    int i = 0;
#ifdef DEBUG
    printf("printGraph() start.\n");
#endif
    GraphList *g = ((GraphList*)[_graph pointerValue]);
  
    while(g->adjList[i].firstedge != NULL && i < MAXVEX)
    {
        printf("顶点:%d  w:%.1f ", g->adjList[i].data.vexid, g->adjList[i].data.weight.distance);
        EdgeNode *e = NULL;
        e = g->adjList[i].firstedge;
        while(e != NULL)
        {
            printf("%d  w:%.1f", e->adjvex,e->weigth.distance);
            e = e->next;
        }
        i++;
        printf("\n");
    }
#ifdef DEBUG
    printf("%d,%d\n", g->numVertexes, g->numEdges);
#endif

}
-(void) DFS:(GraphList*)g :(int) i
{
    
        EdgeNode *p;
        visited[i] = TRUE;
        printf("%c ", g->adjList[i].data.vexid);   //打印顶点，也可以其他操作
        p = g->adjList[i].firstedge;
        while(p)
        {
            if(!visited[p->adjvex])
            {
                [self DFS:g :p->adjvex];
                //DFS(g,p->adjvex);           //对访问的邻接顶点递归调用
            }
            p = p->next;
        }

    
}
-(void)DFSTraverse:(GraphList*)g {
    //GraphList *g = ((GraphList*)[_graph pointerValue]);

        int i;
        for(i = 0; i < g->numVertexes; i++)
        {
            visited[i] = FALSE;
        }
        for(i = 0; i < g->numVertexes; i++)
        {
            if(!visited[i])
            {
                [self DFS:g :i];
            }
        }
}

-(void) BFSTraverse{
    GraphList *g = ((GraphList*)[_graph pointerValue]);
#ifdef DEBUG
    printf("%d,%d\n", g->numVertexes, g->numEdges);
#endif

        int i;
        EdgeNode *p;
        queue q;
        for(i = 0; i < g->numVertexes; i++)
        {
            g->visited[i] = FALSE;
        }
        //InitQueue(&q);
        q = empty();
        for(i = 0; i < g->numVertexes; i++)
        {
            if(!g->visited[i])
            {
                g->visited[i] = TRUE;
                printf("%d ", g->adjList[i].data.vexid);   //打印顶点，也可以其他操作
                //EnQueue(&q, i);
                q=enqueue(i, q);
                while(!empty_huh(q))
                {
                    int m=next(q);
                    //DeQueue(&q, &m);
                    q=dequeue(q);
                    p = g->adjList[m].firstedge;   //  找到当前顶点边表链表头指针
                    while(p)
                    {
                        if(!g->visited[p->adjvex])
                        {
                            g->visited[p->adjvex] = TRUE;
                            printf("%d ", g->adjList[p->adjvex].data.vexid);
                            //EnQueue(&q, p->adjvex);
                            q=enqueue(p->adjvex, q);
                        }
                        p = p->next;
                    }
                }
            }
        }

    
}

-(Distance) Path:(GraphList *)g :(int)start :(int) end
{
    Distance d={0};
    //GraphList *g = ((GraphList*)[_graph pointerValue]);
#ifdef DEBUG
    printf("path %d,%d\n", g->numVertexes, g->numEdges);
#endif
   
    queue q;
    int i;
    for(i = 0; i < g->numVertexes; i++)
    {
        g->adjList[i].weigth.distance = MAXVEX;
        g->adjList[i].path = NULL;
    }
    g->adjList[start].weigth.distance = 0;
    g->adjList[start].weigth.count = 0;

    q = empty();
    q=enqueue(start, q);
    while (!empty_huh(q))
    {
        int v = next(q);
        q=dequeue(q);
        EdgeNode *head = g->adjList[v].firstedge;
        while (head != NULL)
        {
            if (g->adjList[head->adjvex].weigth.distance == MAXVEX)
            {
                g->adjList[head->adjvex].weigth.distance = g->adjList[v].weigth.distance+ head->weigth.distance;
                g->adjList[head->adjvex].weigth.count = g->adjList[v].weigth.count+ 1;
                
                g->adjList[head->adjvex].path =& g->adjList[v];
                q=enqueue(head->adjvex, q);
                //d.count++;
            }
            if(head->adjvex == end)
            {
                d.count =g->adjList[head->adjvex].weigth.count;
                d.weight = g->adjList[head->adjvex].weigth.distance;
                for(int i=0;i<MAXVEX;i++)
                    d.route[i] = -1;
                int loop = 0;
                VertexNode *v =&(g->adjList[end]);
                while(v!=NULL){
                    printf("PATH:%d,",v->data.vexid);
                    d.route[loop++] =v->data.vexid;
                    v = v->path;
                }
                return d;
            }
            head = head->next;
        }
    }
//    while (!empty_huh(q))
//    {
//        printf("%d,",next(q));
//        q=dequeue(q);
//    }
    
    return d;
}

//邻接表的广度遍历算法
//void BFSTraverse(GraphList g)
//{
//    int i;
//    EdgeNode *p;
//    Queue q;
//    for(i = 0; i < g.numVertexes; i++)
//    {
//        visited[i] = FALSE;
//    }
//    InitQueue(&q);
//    for(i = 0; i < g.numVertexes; i++)
//    {
//        if(!visited[i])
//        {
//            visited[i] = TRUE;
//            printf("%c ", g.adjList[i].data);   //打印顶点，也可以其他操作
//            EnQueue(&q, i);
//            while(!QueueEmpty(q))
//            {
//                int m;
//                DeQueue(&q, &m);
//                p = g.adjList[m].firstedge;     找到当前顶点边表链表头指针
//                while(p)
//                {
//                    if(!visited[p->adjvex])
//                    {
//                        visited[p->adjvex] = TRUE;
//                        printf("%c ", g.adjList[p->adjvex].data);
//                        EnQueue(&q, p->adjvex);
//                    }
//                    p = p->next;
//                }
//            }
//        }
//    }
//}
////邻接表的深度递归算法
//void DFS(GraphList g, int i)
//{
//    EdgeNode *p;
//    visited[i] = TRUE;
//    printf("%c ", g->adjList[i].data);   //打印顶点，也可以其他操作
//    p = g->adjList[i].firstedge;
//    while(p)
//    {
//        if(!visited[p->adjvex])
//        {
//            DFS(g, p->adjvex);           //对访问的邻接顶点递归调用
//        }
//        p = p->next;
//    }
//}
//
////邻接表的深度遍历操作
//void DFSTraverse(GraphList g)
//{
//    int i;
//    for(i = 0; i < g.numVertexes; i++)
//    {
//        visited[i] = FALSE;
//    }
//    for(i = 0; i < g.numVertexes; i++)
//    {
//        if(!visited[i])
//        {
//            DFS(g, i);
//        }
//    }
//}
@end
